Repository: nicolaregattieri/zion-code
Catalog: Sources/Zion/Resources/*.lproj/Localizable.strings
Languages: es, pt_br

# map.ops.branch.title
source: Branch Management
es: Gestión de Branches
pt_br: Gerenciamento de Branches

# map.ops.branch.description
source: Checkout, create, merge, rebase, push, pull, rename, and delete branches in a unified interface.
es: Checkout, creación, merge, rebase, push, pull, renombrar y eliminar branches en una interfaz unificada.
pt_br: Checkout, criação, merge, rebase, push, pull, renomear e deletar branches em uma interface unificada.

# map.ops.branch.tip1
source: Click a branch from the list to automatically fill the reference field.
es: Haz clic en una branch de la lista para completar automáticamente el campo de referencia.
pt_br: Clique em uma branch da lista para preencher automaticamente o campo de referência.

# map.ops.rebase.title
source: Visual Interactive Rebase
es: Rebase Interactivo Visual
pt_br: Rebase Interativo Visual

# map.ops.rebase.description
source: Visual interface for pick, reword, edit, squash, fixup, and drop. Reorder commits by dragging.
es: Interfaz visual para pick, reword, edit, squash, fixup y drop. Reordena commits arrastrando.
pt_br: Interface visual para pick, reword, edit, squash, fixup e drop. Reordene commits arrastando.

# map.ops.rebase.tip1
source: Use squash to combine related commits before pushing.
es: Usa squash para combinar commits relacionados antes de hacer push.
pt_br: Use squash para combinar commits relacionados antes de fazer push.

# map.ops.stash.title
source: Stash Management
es: Gestión de Stash
pt_br: Gerenciamento de Stash

# map.ops.stash.description
source: Create stashes with descriptive messages, apply, pop, or drop. View recent stashes in the graph.
es: Crea stashes con mensajes descriptivos, aplica, pop o elimina. Ve stashes recientes en el grafo.
pt_br: Crie stashes com mensagens descritivas, aplique, pop ou remova. Veja stashes recentes no grafo.

# map.ops.tags.title
source: Tag Management
es: Gestión de Tags
pt_br: Gerenciamento de Tags

# map.ops.tags.description
source: Create and remove lightweight tags quickly. The list shows existing tags for reference.
es: Crea y elimina tags lightweight rápidamente. La lista muestra tags existentes como referencia.
pt_br: Crie e remova tags lightweight rapidamente. A lista exibe tags existentes para referência.

# map.worktree.parallel.title
source: Parallel Contexts
es: Contextos Paralelos
pt_br: Contextos Paralelos

# map.worktree.parallel.description
source: Work on multiple branches simultaneously without switching context in the main directory.
es: Trabaja en múltiples branches al mismo tiempo sin cambiar de contexto en el directorio principal.
pt_br: Trabalhe em múltiplas branches ao mesmo tempo sem trocar contexto no diretório principal.

# map.worktree.parallel.tip1
source: Ideal for reviewing PRs while working on another feature.
es: Ideal para revisar PRs mientras trabajas en otra feature.
pt_br: Ideal para revisar PRs enquanto trabalha em outra feature.

# map.worktree.quick.title
source: Quick Creation
es: Creación Rápida
pt_br: Criação Rápida

# map.worktree.quick.description
source: Create a worktree with one click — path and branch are auto-generated.
es: Crea un worktree con un clic — ruta y branch se generan automáticamente.
pt_br: Crie um worktree com um clique — caminho e branch são gerados automaticamente.

# map.worktree.terminal.title
source: Dedicated Terminal
es: Terminal Dedicado
pt_br: Terminal Dedicado

# map.worktree.terminal.description
source: Each worktree automatically opens a dedicated split terminal pane pointing to its directory.
es: Cada worktree abre automáticamente un panel de terminal split dedicado apuntando a su directorio.
pt_br: Cada worktree abre automaticamente um painel de terminal split dedicado apontando para seu diretório.

# map.worktree.terminal.tip1
source: The worktree terminal opens in the correct directory, ready to use.
es: El terminal del worktree se abre en el directorio correcto, listo para usar.
pt_br: O terminal do worktree já abre no diretório correto, pronto para uso.

# map.ai.commit.title
source: AI Commit Messages
es: Mensajes de Commit con IA
pt_br: Mensagens de Commit com IA

# map.ai.commit.description
source: Generates commit messages from staged diff using Anthropic, OpenAI, or Gemini. Heuristic fallback without API.
es: Genera mensajes de commit a partir del diff staged usando Anthropic, OpenAI o Gemini. Fallback heurístico sin API.
pt_br: Gera mensagens de commit a partir do diff staged usando Anthropic, OpenAI ou Gemini. Fallback heurístico sem API.

# map.ai.commit.tip1
source: Toggle between compact (single-line) and detailed (with bullet points) style.
es: Alterna entre estilo compacto (una línea) y detallado (con bullet points).
pt_br: Alterne entre estilo compacto (uma linha) e detalhado (com bullet points).

# map.ai.diff.title
source: Diff Explanation
es: Explicación de Diffs
pt_br: Explicação de Diffs

# map.ai.diff.description
source: Understand any diff in plain language. AI explains intent, risks, and impact of changes.
es: Entiende cualquier diff en lenguaje natural. La IA explica intención, riesgos e impacto de los cambios.
pt_br: Entenda qualquer diff em linguagem natural. A IA explica intenção, riscos e impacto das mudanças.

# map.ai.pr.title
source: Pull Request Description
es: Descripción de Pull Request
pt_br: Descrição de Pull Request

# map.ai.pr.description
source: Automatically generates PR title and body from the branch's commit log.
es: Genera título y cuerpo del PR automáticamente a partir del log de commits de la branch.
pt_br: Gera título e corpo do PR automaticamente a partir do log de commits da branch.

# map.ai.review.title
source: Pre-Commit Code Review
es: Code Review Pre-Commit
pt_br: Code Review Pré-Commit

# map.ai.review.description
source: Automatic analysis of staged code detecting bugs, security issues, and improvement suggestions.
es: Análisis automático del código staged detectando bugs, problemas de seguridad y sugerencias de mejora.
pt_br: Análise automática do código staged detectando bugs, problemas de segurança e sugestões de melhoria.

# map.ai.review.tip1
source: Run before each commit to catch issues early.
es: Ejecútalo antes de cada commit para detectar problemas temprano.
pt_br: Execute antes de cada commit para pegar problemas cedo.

# map.ai.conflict.title
source: AI Conflict Resolution
es: Resolución de Conflictos con IA
pt_br: Resolução de Conflitos com IA

# map.ai.conflict.description
source: AI reads both sides of the merge conflict and proposes a semantically correct resolution.
es: La IA lee ambos lados del conflicto de merge y propone una resolución semánticamente correcta.
pt_br: A IA lê ambos os lados do conflito de merge e propõe uma resolução semanticamente correta.

# map.ai.changelog.title
source: Changelog Generation
es: Generación de Changelog
pt_br: Geração de Changelog

# map.ai.changelog.description
source: Generates categorized release notes (Features/Fixes/Improvements) from a commit range.
es: Genera notas de release categorizadas (Features/Fixes/Improvements) a partir de un rango de commits.
pt_br: Gera notas de release categorizadas (Features/Fixes/Improvements) a partir de um range de commits.

# map.ai.search.title
source: Semantic Search
es: Búsqueda Semántica
pt_br: Busca Semântica

# map.ai.search.description
source: Search Git history in natural language, like 'when did we change the auth flow?'.
es: Busca en el historial Git en lenguaje natural, como '¿cuándo cambiamos el flujo de autenticación?'.
pt_br: Busque no histórico Git em linguagem natural, como 'quando mudamos o fluxo de autenticação?'.

# map.ai.search.tip1
source: Works best with questions about specific features or changes.
es: Funciona mejor con preguntas sobre funcionalidades o cambios específicos.
pt_br: Funciona melhor com perguntas sobre funcionalidades ou mudanças específicas.

# map.ai.blame.title
source: Blame Explainer
es: Explicador de Blame
pt_br: Explicador de Blame

# map.ai.blame.description
source: Click a blame entry to understand WHY that code was changed, not just who changed it.
es: Haz clic en una entrada de blame para entender POR QUÉ se cambió ese código, no solo quién lo cambió.
pt_br: Clique em uma entrada de blame para entender POR QUE aquele código foi alterado, não apenas quem alterou.

# map.ai.split.title
source: Split Advisor
es: Consejero de Split
pt_br: Conselheiro de Split

# map.ai.split.description
source: Suggests how to split a large diff into multiple atomic, focused commits.
es: Sugiere cómo dividir un diff grande en múltiples commits atómicos y enfocados.
pt_br: Sugere como dividir um diff grande em múltiplos commits atômicos e focados.

# map.ai.style.title
source: Message Style
es: Estilo de Mensaje
pt_br: Estilo de Mensagem

# map.ai.style.description
source: Toggle between compact (Conventional Commits) or detailed (header + bullet points) messages.
es: Alterna entre mensajes compactos (Conventional Commits) o detallados (header + bullet points).
pt_br: Alterne entre mensagens compactas (Conventional Commits) ou detalhadas (header + bullet points).

# map.custom.languages.title
source: Languages
es: Idiomas
pt_br: Idiomas

# map.custom.languages.description
source: Interface available in Portuguese (BR), English, and Spanish. Switch anytime in settings.
es: Interfaz disponible en Portugués (BR), English y Español. Cambia en cualquier momento en configuración.
pt_br: Interface disponível em Português (BR), English e Español. Mude a qualquer momento nas configurações.

# map.custom.appearance.title
source: Appearance
es: Apariencia
pt_br: Aparência

# map.custom.appearance.description
source: Choose between light, dark, or automatic system appearance. The editor theme follows.
es: Elige entre modo claro, oscuro o apariencia automática del sistema. El tema del editor acompaña.
pt_br: Escolha entre modo claro, escuro ou automático do sistema. O tema do editor acompanha.

# map.custom.editor.title
source: External Editor and Terminal
es: Editor y Terminal Externos
pt_br: Editor e Terminal Externos

# map.custom.editor.description
source: Configure your favorite editor (VS Code, Cursor, Xcode, etc.) and terminal (Terminal, iTerm, Warp).
es: Configura tu editor (VS Code, Cursor, Xcode, etc.) y terminal (Terminal, iTerm, Warp) favoritos.
pt_br: Configure seu editor (VS Code, Cursor, Xcode, etc.) e terminal (Terminal, iTerm, Warp) favoritos.

# map.custom.editor.tip1
source: Use 'Open Externally' in the sidebar to open the repo in your configured editor.
es: Usa 'Abrir Externamente' en la barra lateral para abrir el repo en el editor configurado.
pt_br: Use 'Abrir Externamente' na sidebar para abrir o repo no editor configurado.

# map.custom.confirmation.title
source: Confirmation Dialogs
es: Diálogos de Confirmación
pt_br: Diálogos de Confirmação

# map.custom.confirmation.description
source: Control when to show confirmation: never, destructive actions only, or all actions.
es: Controla cuándo mostrar confirmación: nunca, solo acciones destructivas, o todas las acciones.
pt_br: Controle quando exibir confirmação: nunca, apenas ações destrutivas, ou todas as ações.

# map.custom.reflog.title
source: Reflog and Undo
es: Reflog y Deshacer
pt_br: Reflog e Desfazer

# map.custom.reflog.description
source: View the last 50 reflog entries. Undo the last Git action with one click.
es: Visualiza las últimas 50 entradas del reflog. Deshaz la última acción Git con un clic.
pt_br: Visualize as últimas 50 entradas do reflog. Desfaça a última ação Git com um clique.

# map.custom.reflog.tip1
source: Undo uses reset --soft, preserving your changes in staging.
es: Deshacer usa reset --soft, preservando tus cambios en staging.
pt_br: O desfazer usa reset --soft, preservando suas mudanças no stage.

# map.diag.log.title
source: Diagnostic Log
es: Log de Diagnóstico
pt_br: Log de Diagnóstico

# map.diag.log.description
source: Ring-buffer capturing errors, Git commands, and AI calls for debugging.
es: Ring-buffer que captura errores, comandos Git y llamadas de IA para depuración.
pt_br: Ring-buffer que captura erros, comandos Git e chamadas de IA para depuração.

# map.diag.export.title
source: Export Log
es: Exportar Log
pt_br: Exportar Log

# map.diag.export.description
source: Save sanitized log to file from the Help menu. Sensitive data is automatically removed.
es: Guarda el log sanitizado en archivo desde el menú Ayuda. Los datos sensibles se eliminan automáticamente.
pt_br: Salve o log sanitizado em arquivo pelo menu Ajuda. Dados sensíveis são removidos automaticamente.

# map.diag.export.tip1
source: Useful for bug reports — include the log in your report.
es: Útil para reportar bugs — incluye el log en tu reporte.
pt_br: Útil para reportar bugs — inclua o log no seu relato.

# map.diag.copy.title
source: Copy Log
es: Copiar Log
pt_br: Copiar Log

# map.diag.copy.description
source: Copy sanitized log to clipboard for quick sharing.
es: Copia el log sanitizado al portapapeles para compartir rápidamente.
pt_br: Copie o log sanitizado para o clipboard para compartilhamento rápido.

# map.conflicts.resolve.title
source: In-App Resolution
es: Resolución en la App
pt_br: Resolução no App

# map.conflicts.resolve.description
source: Resolve merge and rebase conflicts directly in Zion, without opening another editor.
es: Resuelve conflictos de merge y rebase directamente en Zion, sin abrir otro editor.
pt_br: Resolva conflitos de merge e rebase diretamente no Zion, sem precisar abrir outro editor.

# map.conflicts.resolve.tip1
source: With AI configured, use 'Resolve with AI' for an automatic suggestion.
es: Con IA configurada, usa 'Resolver con IA' para una sugerencia automática.
pt_br: Com IA configurada, use 'Resolver com IA' para uma sugestão automática.

# map.conflicts.choose.title
source: Side Selection
es: Selección de Lado
pt_br: Escolha de Lado

# map.conflicts.choose.description
source: Accept Ours, Theirs, Both, Both (reversed), or manually edit each conflict region.
es: Acepta Nuestro, Ellos, Ambos, Ambos (inverso) o edita manualmente cada región de conflicto.
pt_br: Aceite Nosso, Deles, Ambos, Ambos (inverso) ou edite manualmente cada região de conflito.

# map.conflicts.continue.title
source: Continue Merge/Rebase
es: Continuar Merge/Rebase
pt_br: Continuar Merge/Rebase

# map.conflicts.continue.description
source: After resolving all conflicts, continue the merge or rebase with one click.
es: Después de resolver todos los conflictos, continúa el merge o rebase con un clic.
pt_br: Após resolver todos os conflitos, continue o merge ou rebase com um clique.

# settings.tab.ai
source: AI Assistant
es: Asistente IA
pt_br: Assistente IA

# settings.tab.notifications
source: Notifications
es: Notificaciones
pt_br: Notificações

# settings.general.interface
source: Interface
es: Interfaz

# settings.general.tools
source: Tools
es: Herramientas
pt_br: Ferramentas

# settings.general.safety
source: Safety
es: Seguridad
pt_br: Segurança

# settings.general.confirmation
source: Confirmation Mode
es: Modo de Confirmación
pt_br: Modo de Confirmação

# settings.general.customPath
source: Custom Path
es: Ruta Personalizada
pt_br: Caminho Personalizado

# settings.open
source: Open Settings
es: Abrir Configuración
pt_br: Abrir Configurações

# settings.open.hint
source: Open Settings (⌘,)
es: Abrir Configuración (⌘,)
pt_br: Abrir Configurações (⌘,)

# settings.ai.provider
source: AI Provider
es: Proveedor de IA
pt_br: Provedor de IA

# settings.ai.commitStyle
source: Commit Style
es: Estilo de Commit
pt_br: Estilo de Commit

# settings.ai.diffExplanation
source: Diff Explanation
es: Explicación de Diff
pt_br: Explicação de Diff

# settings.ai.autoExplain
source: Auto-explain diffs on selection
es: Explicar diffs automáticamente al seleccionar
pt_br: Explicar diffs automaticamente ao selecionar

# settings.ai.depth
source: Explanation Depth
es: Profundidad de la Explicación
pt_br: Profundidade da Explicação

# settings.notifications.topic
source: ntfy Topic
es: Tema ntfy
pt_br: Tópico ntfy

# settings.notifications.preferences
source: Preferences
es: Preferencias
pt_br: Preferências

# settings.notifications.events
source: Events
es: Eventos
pt_br: Eventos

# settings.notifications.test
source: Test
es: Probar
pt_br: Testar

# settings.notifications.prPolling
source: PR Polling Interval
es: Intervalo de Polling de PRs
pt_br: Intervalo de Polling de PRs

# settings.notifications.prPolling.2min
source: Every 2 minutes
es: Cada 2 minutos
pt_br: A cada 2 minutos

# settings.notifications.prPolling.5min
source: Every 5 minutes
es: Cada 5 minutos
pt_br: A cada 5 minutos

# settings.notifications.prPolling.10min
source: Every 10 minutes
es: Cada 10 minutos
pt_br: A cada 10 minutos

# settings.notifications.prPolling.30min
source: Every 30 minutes
es: Cada 30 minutos
pt_br: A cada 30 minutos

# settings.notifications.autoReview
source: Auto-review assigned PRs
es: Revisar PRs asignados automáticamente
pt_br: Revisar PRs atribuídos automaticamente

# settings.notifications.server
source: Server URL
es: URL del Servidor
pt_br: URL do Servidor

# settings.diff.depth.quick
source: Quick
es: Rápido
pt_br: Rápido

# settings.diff.depth.detailed
source: Detailed
es: Detallado
pt_br: Detalhado

# diff.explanation.title
source: AI Explanation
es: Explicación IA
pt_br: Explicação IA

# diff.explanation.intent
source: Intent
es: Intención
pt_br: Intenção

# diff.explanation.risks
source: Risks
es: Riesgos
pt_br: Riscos

# diff.explanation.narrative
source: Narrative
es: Narrativa
pt_br: Narrativa

# diff.explanation.copy
source: Copy
es: Copiar
pt_br: Copiar

# diff.explanation.loading
source: Analyzing diff...
es: Analizando diff...
pt_br: Analisando diff...

# diff.severity.safe
source: Safe
es: Seguro
pt_br: Seguro

# diff.severity.moderate
source: Moderate
es: Moderado
pt_br: Moderado

# diff.severity.risky
source: Risky
es: Arriesgado
pt_br: Arriscado

# codereview.files
source: Files
es: Archivos
pt_br: Arquivos

# codereview.reviewAll
source: Review All
es: Revisar Todos
pt_br: Revisar Todos

# codereview.selectFile
source: Select a file to view details.
es: Seleccione un archivo para ver los detalles.
pt_br: Selecione um arquivo para ver os detalhes.

# codereview.copySummary
source: Copy Summary
es: Copiar Resumen
pt_br: Copiar Resumo

# codereview.exportMarkdown
source: Export Markdown
es: Exportar Markdown
pt_br: Exportar Markdown

# codereview.stats.files
source: files
es: archivos
pt_br: arquivos

# codereview.card.subtitle
source: Full file-by-file AI-powered code review
es: Revisión completa archivo por archivo con IA
pt_br: Revisão completa arquivo por arquivo com IA

# codereview.startReview
source: Start Review
es: Iniciar Revisión
pt_br: Iniciar Revisão

# codereview.startReview.hint
source: Start a full code review between branches (⇧⌘R)
es: Iniciar revisión completa entre ramas (⇧⌘R)
pt_br: Iniciar revisão completa entre branches (⇧⌘R)

# file.status.added
source: Added
es: Añadido
pt_br: Adicionado

# file.status.modified
source: Modified
es: Modificado
pt_br: Modificado

# file.status.deleted
source: Deleted
es: Eliminado
pt_br: Removido

# file.status.renamed
source: Renamed
es: Renombrado
pt_br: Renomeado

# branch.review.fullReview
source: Full Review
es: Revisión Completa
pt_br: Revisão Completa

# branch.review.fullReview.hint
source: Open the full code review screen
es: Abrir pantalla de revisión completa
pt_br: Abrir tela de revisão completa

# pr.inbox.title
source: PR Reviews
es: Revisiones de PR
pt_br: Revisões de PR

# pr.inbox.reviewAll
source: Review All
es: Revisar Todos
pt_br: Revisar Todos

# pr.inbox.openGitHub
source: Open on GitHub
es: Abrir en GitHub
pt_br: Abrir no GitHub

# pr.status.pending
source: Pending
es: Pendiente
pt_br: Pendente

# pr.status.reviewing
source: Reviewing...
es: Revisando...
pt_br: Revisando...

# pr.status.reviewed
source: Reviewed
es: Revisado
pt_br: Revisado

# pr.status.clean
source: Clean
es: Limpio
pt_br: Limpo

# ntfy.event.prAutoReviewComplete
source: PR auto-review complete
es: Revisión automática de PR completada
pt_br: Revisão automática de PR concluída

# help.settings.title
source: Settings Window
es: Ventana de Configuración
pt_br: Janela de Configurações

# help.settings.features
source: Cmd+, shortcut|General, AI, Notifications tabs|Language, appearance, terminal|API key management
es: Atajo Cmd+,|Pestañas: General, IA, Notificaciones|Idioma, apariencia, terminal|Gestión de clave API
pt_br: Atalho Cmd+,|Abas: Geral, IA, Notificações|Idioma, aparência, terminal|Gerenciamento de chave API

# help.diffExplanation.title
source: AI Diff Explanation
es: Explicación de Diff con IA
pt_br: Explicação de Diff com IA

# help.diffExplanation.features
source: Intent, Risks, Narrative|Risk severity badges|Auto-explain on selection|Copy to clipboard
es: Intención, Riesgos, Narrativa|Insignias de severidad|Explicar automáticamente al seleccionar|Copiar al portapapeles
pt_br: Intenção, Riscos, Narrativa|Badges de severidade|Explicar automaticamente ao selecionar|Copiar para área de transferência

# help.codeReview.features
source: Full-window file-by-file review|Per-file AI analysis|Export as Markdown|Cmd+Shift+R shortcut
es: Revisión a pantalla completa por archivo|Análisis IA por archivo|Exportar como Markdown|Atajo Cmd+Shift+R
pt_br: Revisão em tela cheia por arquivo|Análise IA por arquivo|Exportar como Markdown|Atalho Cmd+Shift+R

# help.prInbox.title
source: PR Inbox
es: Bandeja de PRs
pt_br: Caixa de PRs

# help.prInbox.features
source: Assigned PR queue|Browse all open PRs|Auto-review with AI|Click to open in Code Review|macOS + ntfy notifications
es: Cola de PRs asignados|Revisión automática con IA|Clic para abrir en Code Review|Notificaciones macOS + ntfy
pt_br: Fila de PRs atribuídos|Revisão automática com IA|Clique para abrir no Code Review|Notificações macOS + ntfy

# map.settings.subtitle
source: Native macOS settings window with 3 organized tabs.
es: Ventana de configuración nativa de macOS con 3 pestañas organizadas.
pt_br: Janela de configurações nativa do macOS com 3 abas organizadas.

# map.settings.window.title
source: Settings Window
es: Ventana de Configuración
pt_br: Janela de Configurações

# map.settings.window.description
source: Full macOS Settings window accessible via Cmd+, with General, AI, and Notifications tabs.
es: Ventana de Configuración completa de macOS accesible vía Cmd+, con pestañas General, IA y Notificaciones.
pt_br: Janela de Configurações completa do macOS acessível via Cmd+, com abas Geral, IA e Notificações.

# map.settings.tabs.title
source: Organized Tabs
es: Pestañas Organizadas
pt_br: Abas Organizadas

# map.settings.tabs.description
source: Settings split into logical groups: Interface & Tools, AI provider & style, Notifications & PR polling.
es: Configuración dividida en grupos lógicos: Interfaz y Herramientas, Proveedor y estilo de IA, Notificaciones y polling de PRs.
pt_br: Configurações divididas em grupos lógicos: Interface e Ferramentas, Provedor e estilo de IA, Notificações e polling de PRs.

# map.settings.api.title
source: API Key Management
es: Gestión de Clave API
pt_br: Gerenciamento de Chave API

# map.settings.api.description
source: Securely manage AI provider API keys stored in macOS Keychain.
es: Gestione claves API de proveedores de IA almacenadas en el Keychain de macOS de forma segura.
pt_br: Gerencie chaves API de provedores de IA armazenadas no Keychain do macOS com segurança.

# map.diffExplanation.subtitle
source: AI-powered structured diff analysis with risk assessment.
es: Análisis estructurado de diff con IA y evaluación de riesgo.
pt_br: Análise estruturada de diff com IA e avaliação de risco.

# map.diffexp.structured.title
source: Structured Analysis
es: Análisis Estructurado
pt_br: Análise Estruturada
