Repository: nicolaregattieri/zion-code
Catalog: Sources/Zion/Resources/*.lproj/Localizable.strings
Languages: es, pt_br

# map.diffexp.structured.description
source: Every diff gets Intent, Risks, and Narrative sections for comprehensive understanding.
es: Cada diff recibe secciones de Intención, Riesgos y Narrativa para comprensión completa.
pt_br: Cada diff recebe seções de Intenção, Riscos e Narrativa para compreensão completa.

# map.diffexp.severity.title
source: Risk Severity
es: Severidad de Riesgo
pt_br: Severidade de Risco

# map.diffexp.severity.description
source: Color-coded severity badges (Safe/Moderate/Risky) help prioritize review attention.
es: Insignias de severidad con colores (Seguro/Moderado/Arriesgado) ayudan a priorizar la atención de revisión.
pt_br: Badges de severidade com cores (Seguro/Moderado/Arriscado) ajudam a priorizar a atenção da revisão.

# map.diffexp.auto.title
source: Auto-Explain
es: Explicación Automática
pt_br: Explicação Automática

# map.diffexp.auto.description
source: Enable auto-explain to analyze diffs automatically when selecting files.
es: Active la explicación automática para analizar diffs automáticamente al seleccionar archivos.
pt_br: Ative a explicação automática para analisar diffs automaticamente ao selecionar arquivos.

# map.diffexp.auto.tip1
source: Toggle in Settings > AI > Auto-explain diffs on selection.
es: Active en Configuración > IA > Explicar diffs automáticamente al seleccionar.
pt_br: Ative em Configurações > IA > Explicar diffs automaticamente ao selecionar.

# map.codeReview.subtitle
source: Full-window file-by-file code review powered by AI.
es: Revisión de código a pantalla completa archivo por archivo con IA.
pt_br: Revisão de código em tela cheia arquivo por arquivo com IA.

# map.codereview.fullscreen.title
source: Full-Screen Review
es: Revisión a Pantalla Completa
pt_br: Revisão em Tela Cheia

# map.codereview.fullscreen.description
source: Dedicated 1000x700 review window with file list, diff viewer, and AI findings side by side.
es: Ventana dedicada de 1000x700 con lista de archivos, visor de diff y hallazgos de IA lado a lado.
pt_br: Janela dedicada de 1000x700 com lista de arquivos, visualizador de diff e achados da IA lado a lado.

# map.codereview.perfile.title
source: Per-File AI Analysis
es: Análisis IA por Archivo
pt_br: Análise IA por Arquivo

# map.codereview.perfile.description
source: Each file gets individual AI review with structured findings and diff explanation.
es: Cada archivo recibe revisión individual de IA con hallazgos estructurados y explicación de diff.
pt_br: Cada arquivo recebe revisão individual da IA com achados estruturados e explicação de diff.

# map.codereview.export.title
source: Export & Share
es: Exportar y Compartir
pt_br: Exportar e Compartilhar

# map.codereview.export.description
source: Copy summary to clipboard or export the full review as Markdown for PR comments.
es: Copie el resumen al portapapeles o exporte la revisión completa como Markdown para comentarios de PR.
pt_br: Copie o resumo para a área de transferência ou exporte a revisão completa como Markdown para comentários de PR.

# map.prInbox.subtitle
source: Track assigned PRs with automatic AI review.
es: Acompañe PRs asignados con revisión automática por IA.
pt_br: Acompanhe PRs atribuídos com revisão automática por IA.

# map.prinbox.queue.title
source: PR Queue
es: Cola de PRs
pt_br: Fila de PRs

# map.prinbox.queue.description
source: Sidebar card showing all assigned PRs with status badges and severity summaries.
es: Card en la sidebar mostrando todos los PRs asignados con insignias de estado y resúmenes de severidad.
pt_br: Card na sidebar mostrando todos os PRs atribuídos com badges de status e resumos de severidade.

# map.prinbox.autoreview.title
source: Auto-Review
es: Revisión Automática
pt_br: Revisão Automática

# map.prinbox.autoreview.description
source: When enabled, AI automatically reviews assigned PRs and notifies you with findings ready.
es: Cuando está activado, la IA revisa automáticamente PRs asignados y le notifica con los hallazgos listos.
pt_br: Quando ativado, a IA revisa automaticamente PRs atribuídos e notifica você com os achados prontos.

# map.prinbox.notifications.title
source: Review Notifications
es: Notificaciones de Revisión
pt_br: Notificações de Revisão

# map.prinbox.notifications.description
source: Get macOS notifications and ntfy push alerts when AI completes PR reviews.
es: Reciba notificaciones de macOS y alertas push vía ntfy cuando la IA complete revisiones de PR.
pt_br: Receba notificações do macOS e alertas push via ntfy quando a IA completar revisões de PR.

# Erro
source: Error
pt_br: Erro

# Resolver na IDE
source: Resolve in IDE
pt_br: Resolver na IDE

# Recentes
source: Recent
pt_br: Recentes

# Detalhes
source: Details
pt_br: Detalhes

# Busca
source: Search
pt_br: Busca

# Saltar para
source: Jump to
pt_br: Saltar para

source: Danger Zone
pt_br: Zona de Perigo

# Executar
source: Execute
pt_br: Executar

# Fazer checkout da nova branch
source: Checkout new branch
pt_br: Fazer checkout da nova branch

# Nome da branch a partir de %@
source: Branch name from %@:
pt_br: Nome da branch a partir de %@:

source: Checkout & Open in Editor
pt_br: Checkout & Abrir no Editor

source: detached
pt_br: desanexado

# settings.tab.general
source: General
pt_br: Geral

# pr.inbox.empty
source: No PRs awaiting review
pt_br: Nenhum PR aguardando revisão

# pr.inbox.setup.hint
source: Requires gh CLI authenticated (gh auth login)
pt_br: Requer gh CLI autenticado (gh auth login)

# Buscar Atualizacoes...
source: Check for Updates…
pt_br: Buscar Atualizações...

# help.updates.title
source: Auto Updates
pt_br: Atualizações Automáticas

# help.updates.check
source: Check for updates from the Help menu
pt_br: Busque atualizações pelo menu Ajuda

# help.updates.auto
source: Automatic daily background update checks
pt_br: Verificação automática diária em segundo plano

# help.updates.delta
source: Delta updates for smaller downloads
pt_br: Atualizações delta para downloads menores

# map.autoUpdates.subtitle
source: Native auto-updates via Sparkle with daily background checks.
pt_br: Atualizações automáticas nativas via Sparkle com verificação diária.

# map.updates.check.title
source: Check for Updates
pt_br: Buscar Atualizações

# map.updates.check.description
source: Manually check for new versions from Help > Check for Updates.
pt_br: Busque manualmente por novas versões pelo menu Ajuda > Buscar Atualizações.

# map.updates.auto.title
source: Automatic Checks
pt_br: Verificação Automática

# map.updates.auto.description
source: Zion automatically checks for updates every 24 hours in the background.
pt_br: O Zion verifica automaticamente se há atualizações a cada 24 horas em segundo plano.

# map.updates.delta.title
source: Delta Updates
pt_br: Atualizações Delta

# map.updates.delta.description
source: Smart downloads that only transfer the differences between versions.
pt_br: Downloads inteligentes que transferem apenas as diferenças entre versões.
