Repository: nicolaregattieri/zion-code
Catalog: Sources/Zion/Resources/*.lproj/Localizable.strings
Languages: es, pt_br

# Fonte do terminal
source: Terminal font
es: Fuente del terminal
pt_br: Fonte do terminal

# Fonte
source: Font
es: Fuente
pt_br: Fonte

# Tamanho
source: Size
es: Tamaño
pt_br: Tamanho

# Criar worktree rapido
source: Quick create worktree
es: Crear worktree rápido
pt_br: Criar worktree rápido

# Fechar painel
source: Close pane
es: Cerrar panel
pt_br: Fechar painel

# Somente editor
source: Editor only
es: Solo editor
pt_br: Somente editor

# Editor e terminal
source: Editor and terminal
es: Editor y terminal
pt_br: Editor e terminal

# Somente terminal
source: Terminal only
es: Solo terminal
pt_br: Somente terminal

# Clonar Repositorio
source: Clone Repository
es: Clonar Repositorio
pt_br: Clonar Repositório

# Baixe um repositorio remoto para o disco local.
source: Download a remote repository to your local disk.
es: Descarga un repositorio remoto a tu disco local.
pt_br: Baixe um repositório remoto para o disco local.

# URL do repositorio
source: Repository URL
es: URL del repositorio
pt_br: URL do repositório

# Pasta de destino
source: Destination folder
es: Carpeta de destino
pt_br: Pasta de destino

# Nome do repositorio
source: Repository name
es: Nombre del repositorio
pt_br: Nome do repositório

# Escolher...
source: Browse...
es: Elegir...
pt_br: Escolher...

# Escolher
source: Browse
es: Elegir
pt_br: Escolher

# Clonar
source: Clone
es: Clonar
pt_br: Clonar

# Clonar repositorio...
source: Clone repository...
es: Clonar repositorio...
pt_br: Clonar repositório...

# Clonar repositorio remoto
source: Clone remote repository
es: Clonar repositorio remoto
pt_br: Clonar repositório remoto

# Clipboard Inteligente
source: Smart Clipboard
es: Portapapeles Inteligente
pt_br: Clipboard Inteligente

# Captura automaticamente o que voce copiar
source: Automatically captures what you copy
es: Captura automaticamente lo que copies
pt_br: Captura automaticamente o que você copiar

# Clique para colar no terminal
source: Click to paste in terminal
es: Clic para pegar en terminal
pt_br: Clique para colar no terminal

# Duplo clique para executar
source: Double-click to execute
es: Doble clic para ejecutar
pt_br: Duplo clique para executar

# Arraste para o terminal
source: Drag to terminal
es: Arrastra al terminal
pt_br: Arraste para o terminal

# Copie algo para comecar
source: Copy something to get started
es: Copia algo para empezar
pt_br: Copie algo para começar

# Atualizar arvore de arquivos
source: Refresh file tree
es: Actualizar árbol de archivos
pt_br: Atualizar árvore de arquivos

# Novo terminal
source: New terminal
es: Nuevo terminal
pt_br: Novo terminal

# Limpar busca
source: Clear search
es: Limpiar búsqueda
pt_br: Limpar busca

# Resultado anterior
source: Previous result
es: Resultado anterior
pt_br: Resultado anterior

# Proximo resultado
source: Next result
es: Siguiente resultado
pt_br: Próximo resultado

# Adicionar todos ao stage
source: Stage all files
es: Agregar todos al stage
pt_br: Adicionar todos ao stage

# Remover todos do stage
source: Unstage all files
es: Quitar todos del stage
pt_br: Remover todos do stage

# Atalhos de Teclado
source: Keyboard Shortcuts
es: Atajos de Teclado
pt_br: Atalhos de Teclado

# Navegacao
source: Navigation
es: Navegación
pt_br: Navegação

# Codigo
source: Code
es: Código
pt_br: Código

# Grafo
source: Graph
es: Grafo
pt_br: Grafo

# Barra lateral
source: Sidebar
es: Barra lateral
pt_br: Barra lateral

# Maximizar terminal
source: Maximize terminal
es: Maximizar terminal
pt_br: Maximizar terminal

# Nova aba
source: New tab
es: Nueva pestaña
pt_br: Nova aba

# Fechar painel dividido
source: Close split pane
es: Cerrar panel dividido
pt_br: Fechar painel dividido

# Buscar no grafo
source: Search graph
es: Buscar en el grafo
pt_br: Buscar no grafo

# Pressione
source: Press
es: Presiona
pt_br: Pressione

# para ver todos os atalhos
source: to see all shortcuts
es: para ver todos los atajos
pt_br: para ver todos os atalhos

# Assistente IA
source: AI Assistant
es: Asistente IA
pt_br: Assistente IA

# Desativado
source: Disabled
es: Desactivado
pt_br: Desativado

# Cota da API excedida ou saldo insuficiente
source: API quota exceeded or insufficient balance
es: Cuota de API excedida o saldo insuficiente
pt_br: Cota da API excedida ou saldo insuficiente

# Cota da API excedida. Usando sugestao local.
source: API quota exceeded. Using local suggestion.
es: Cuota de API excedida. Usando sugerencia local.
pt_br: Cota da API excedida. Usando sugestão local.

# Git não encontrado
source: Git not found
es: Git no encontrado
pt_br: Git não encontrado

# Baixar Git
source: Download Git
es: Descargar Git
pt_br: Baixar Git

source: Zion requires Git to be installed. Please install Git and restart the app.
es: Zion requiere que Git esté instalado. Por favor, instala Git y reinicia la aplicación.
pt_br: O Zion precisa do Git instalado para funcionar. Por favor, instale o Git e reinicie o app.

# Chave registrada
source: Key registered
es: Clave registrada
pt_br: Chave registrada

# Alterar
source: Change
es: Cambiar
pt_br: Alterar

# Chave de API
source: API Key
es: Clave de API
pt_br: Chave de API

# Chave salva no Keychain
source: Key saved in Keychain
es: Clave guardada en Keychain
pt_br: Chave salva no Keychain

# Gerar mensagem com IA
source: Generate message with AI
es: Generar mensaje con IA
pt_br: Gerar mensagem com IA

# Gerar com IA
source: Generate with AI
es: Generar con IA
pt_br: Gerar com IA

# Explicar diff com IA
source: Explain diff with AI
es: Explicar diff con IA
pt_br: Explicar diff com IA

# Nenhum provedor de IA configurado
source: No AI provider configured
es: Ningún proveedor de IA configurado
pt_br: Nenhum provedor de IA configurado

# Chave de API invalida
source: Invalid API key
es: Clave de API inválida
pt_br: Chave de API inválida

# Resposta invalida da API
source: Invalid API response
es: Respuesta inválida de la API
pt_br: Resposta inválida da API

# Conheca o Zion
source: Discover Zion
es: Descubre Zion
pt_br: Conheça o Zion

# help.hero.title
source: Everything you need to work with Git, native on your Mac.
es: Todo lo que necesitas para trabajar con Git, nativo en tu Mac.
pt_br: Tudo que você precisa para trabalhar com Git, nativo no seu Mac.

# help.hero.subtitle
source: Zion combines graph visualization, code editor, integrated terminal, and Git operations — all in a single native macOS interface.
es: Zion combina visualización de grafo, editor de código, terminal integrado y operaciones Git — todo en una interfaz nativa de macOS.
pt_br: O Zion combina visualização de grafo, editor de código, terminal integrado e operações Git — tudo em uma única interface nativa macOS.

# help.tree.lanes
source: Visual graph with color-coded lanes showing branch and merge topology
es: Grafo visual con lanes coloreados mostrando topología de branches y merges
pt_br: Grafo visual com lanes coloridas mostrando topologia de branches e merges

# help.tree.search
source: Search by hash, author, or message with result navigation (⌘F)
es: Busca por hash, autor o mensaje con navegación entre resultados (⌘F)
pt_br: Busca por hash, autor ou mensagem com navegação entre resultados (⌘F)

# help.tree.jumpbar
source: Jump Bar to instantly scroll to main, develop, or default branch
es: Jump Bar para saltar instantáneamente a main, develop o branch por defecto
pt_br: Jump Bar para saltar instantaneamente para main, develop ou branch padrão

# help.tree.pending
source: Pending changes at the top of the graph with quick commit and stash
es: Cambios pendientes al tope del grafo con commit rápido y stash
pt_br: Alterações pendentes no topo do grafo com commit rápido e stash

# help.tree.signature
source: GPG/SSH commit signature verification
es: Verificación de firma GPG/SSH de commits
pt_br: Verificação de assinatura GPG/SSH dos commits

# help.code.editor
source: Editor with syntax highlighting, multiple tabs, and external change detection
es: Editor con syntax highlighting, múltiples pestañas y detección de cambios externos
pt_br: Editor com syntax highlighting, múltiplas abas e detecção de alterações externas

# help.code.quickopen
source: Quick Open with fuzzy search to open files instantly (⌘P)
es: Quick Open con búsqueda fuzzy para abrir archivos al instante (⌘P)
pt_br: Quick Open com busca fuzzy para abrir arquivos instantaneamente (⌘P)

# help.code.blame
source: Inline Git Blame showing author, hash, and date per line
es: Git Blame inline mostrando autor, hash y fecha por línea
pt_br: Git Blame inline mostrando autor, hash e data por linha

# help.code.themes
source: Editor themes (Dracula, GitHub Light, etc.) and configurable fonts
es: Temas de editor (Dracula, GitHub Light, etc.) y fuentes configurables
pt_br: Temas de editor (Dracula, GitHub Light, etc.) e fontes configuráveis

# help.code.unsaved
source: Visual indicator for unsaved changes in tabs
es: Indicador visual de cambios no guardados en pestañas
pt_br: Indicador visual de alterações não salvas nas abas

# help.terminal.pty
source: Real terminal with native PTY, login shell, and 256-color support
es: Terminal real con PTY nativo, login shell y soporte 256 colores
pt_br: Terminal real com PTY nativo, login shell e suporte a cores 256

# help.terminal.splits
source: Split terminal into vertical (⇧⌘D) or horizontal (⇧⌘E) panes
es: Divide el terminal en paneles verticales (⇧⌘D) u horizontales (⇧⌘E)
pt_br: Divide o terminal em painéis verticais (⇧⌘D) ou horizontais (⇧⌘E)

# help.terminal.tabs
source: Multiple terminal tabs with live process status
es: Múltiples pestañas de terminal con estado de proceso vivo
pt_br: Múltiplas abas de terminal com status de processo vivo

# help.terminal.zoom
source: Independent zoom with Ctrl+/- and configurable font
es: Zoom independiente con Ctrl+/- y fuente configurable
pt_br: Zoom independente com Ctrl+/- e fonte configurável

# help.terminal.persistence
source: Terminals persist across repo switches with live change badges
es: Los terminales persisten al cambiar de repositorio, con badges de cambios
pt_br: Terminais persistem ao trocar de repositório, com badges de alterações

# help.clipboard.capture
source: Automatically captures everything you copy to the clipboard
es: Captura automáticamente todo lo que copias al portapapeles
pt_br: Captura automaticamente tudo que você copia na área de transferência

# help.clipboard.paste
source: Click to paste in terminal, double-click to execute
es: Clic para pegar en terminal, doble clic para ejecutar
pt_br: Clique para colar no terminal, duplo clique para executar

# help.clipboard.drag
source: Drag items directly into the terminal
es: Arrastra elementos directamente al terminal
pt_br: Arraste itens diretamente para o terminal

# help.clipboard.images
source: Captures copied images with automatic cleanup
es: Captura imágenes copiadas con limpieza automática
pt_br: Captura imagens copiadas com limpeza automática

# help.ops.commit
source: Commit with individual staging, amend, and AI-suggested messages
es: Commit con staging individual, amend y mensajes sugeridos por IA
pt_br: Commit com staging individual, amend e mensagens sugeridas por IA

# help.ops.branch
source: Checkout, merge, rebase, push, pull, and full branch management
es: Checkout, merge, rebase, push, pull y gestión completa de branches
pt_br: Checkout, merge, rebase, push, pull e gerenciamento completo de branches

# help.ops.stash
source: Save, apply, pop, and manage stashes with messages
es: Guardar, aplicar, pop y gestionar stashes con mensajes
pt_br: Salvar, aplicar, pop e gerenciar stashes com mensagens

# help.ops.rebase
source: Visual interactive rebase with pick, squash, fixup, drop, and reordering
es: Rebase interactivo visual con pick, squash, fixup, drop y reordenamiento
pt_br: Rebase interativo visual com pick, squash, fixup, drop e reordenação

# help.ops.hunk
source: Hunk and line staging — granular control over what goes into the commit
es: Staging por hunk y por línea — control granular de lo que entra en el commit
pt_br: Staging por hunk e por linha — controle granular do que entra no commit

# help.worktree.parallel
source: Work on multiple branches simultaneously without switching context
es: Trabaja en múltiples branches simultáneamente sin cambiar de contexto
pt_br: Trabalhe em múltiplas branches simultaneamente sem trocar contexto

# help.worktree.quick
source: Quick creation with auto-generated path and branch name
es: Creación rápida con ruta y branch generados automáticamente
pt_br: Criação rápida com caminho e branch gerados automaticamente

# help.worktree.terminal
source: Each worktree opens a dedicated split terminal
es: Cada worktree abre un terminal split dedicado
pt_br: Cada worktree abre um terminal split dedicado

# help.ai.commit
source: Generates commit messages from staged diff
es: Genera mensajes de commit a partir del diff staged
pt_br: Gera mensagens de commit a partir do diff staged

# help.ai.diff
source: Explains diffs in plain language
es: Explica diffs en lenguaje natural
pt_br: Explica diffs em linguagem natural

# help.ai.pr
source: Generates Pull Request title and description
es: Genera título y descripción de Pull Requests
pt_br: Gera título e descrição de Pull Requests

# help.ai.stash
source: Suggests descriptive stash messages
es: Sugiere mensajes descriptivos para stashes
pt_br: Sugere mensagens descritivas para stashes

# help.customization.title
source: Customization
es: Personalización
pt_br: Personalização

# help.customization.languages
source: Interface in Portuguese, English, and Spanish
es: Interfaz en Portugués, English y Español
pt_br: Interface em Português, English e Español

# help.customization.editor
source: Choose your favorite external editor and terminal
es: Elige tu editor y terminal externo favorito
pt_br: Escolha seu editor e terminal externo favorito

# help.customization.confirmation
source: Control when confirmation dialogs appear
es: Controla cuándo mostrar diálogos de confirmación
pt_br: Controle quando exibir diálogos de confirmação

# help.customization.reflog
source: Visual reflog with undo for the last Git action
es: Reflog visual con deshacer la última acción Git
pt_br: Reflog visual com desfazer da última ação Git

# help.shortcuts.title
source: Over 15 keyboard shortcuts
es: Más de 15 atajos de teclado
pt_br: Mais de 15 atalhos de teclado

# help.shortcuts.subtitle
source: Press ⌘? to see all available shortcuts.
es: Presiona ⌘? para ver todos los atajos disponibles.
pt_br: Pressione ⌘? para ver todos os atalhos disponíveis.

# Exportar Diagnostico...
source: Export Diagnostics...
es: Exportar Diagnóstico...
pt_br: Exportar Diagnóstico...

# Copiar Diagnostico
source: Copy Diagnostics
es: Copiar Diagnóstico
pt_br: Copiar Diagnóstico

# Exportar log de diagnostico
source: Export diagnostic log
es: Exportar log de diagnóstico
pt_br: Exportar log de diagnóstico

# help.diagnostics.title
source: Diagnostics
es: Diagnóstico
pt_br: Diagnóstico

# help.diagnostics.export
source: Export logs from the Help menu
es: Exporte logs desde el menú Ayuda
pt_br: Exporte logs pelo menu Ajuda

# help.diagnostics.copy
source: Copy log to clipboard
es: Copie el log al portapapeles
pt_br: Copie o log para o clipboard

# help.diagnostics.sanitize
source: Sensitive data automatically redacted
es: Datos sensibles eliminados automáticamente
pt_br: Dados sensíveis removidos automaticamente

# Resolver no Zion
source: Resolve in Zion
es: Resolver en Zion
pt_br: Resolver no Zion

# Resolver Conflitos
source: Resolve Conflicts
es: Resolver Conflictos
pt_br: Resolver Conflitos

# Aceitar Nosso
source: Accept Ours
es: Aceptar Nuestro
pt_br: Aceitar Nosso

# Aceitar Deles
source: Accept Theirs
es: Aceptar de Ellos
pt_br: Aceitar Deles

# Aceitar Ambos
source: Accept Both
es: Aceptar Ambos
pt_br: Aceitar Ambos

# Editar Manualmente
source: Edit Manually
es: Editar Manualmente
pt_br: Editar Manualmente

# Aplicar
source: Apply
es: Aplicar
pt_br: Aplicar

# Marcar como Resolvido
source: Mark as Resolved
es: Marcar como Resuelto
pt_br: Marcar como Resolvido

# Continuar Merge
source: Continue Merge
es: Continuar Merge
pt_br: Continuar Merge

# Continuar Rebase
source: Continue Rebase
es: Continuar Rebase
pt_br: Continuar Rebase

# Todos os conflitos resolvidos!
source: All conflicts resolved!
es: Todos los conflictos resueltos!
pt_br: Todos os conflitos resolvidos!

# conflitos restantes
source: conflicts remaining
es: conflictos restantes
pt_br: conflitos restantes

# Conflito
source: Conflict
es: Conflicto
pt_br: Conflito

# arquivos
source: files
es: archivos
pt_br: arquivos

# Selecione um arquivo com conflito
source: Select a conflicted file
es: Seleccione un archivo con conflicto
pt_br: Selecione um arquivo com conflito

# help.conflicts.title
source: Conflict Resolution
es: Resolución de Conflictos
pt_br: Resolução de Conflitos

# help.conflicts.resolve
source: Built-in merge conflict resolver
es: Resuelva conflictos de merge en la app
pt_br: Resolva conflitos de merge direto no app

# help.conflicts.choose
source: Accept Ours, Theirs, Both, or Edit
es: Aceptar Nuestro, Ellos, Ambos o Editar
pt_br: Aceite Nosso, Deles, Ambos ou Edite

# help.conflicts.continue
source: Continue merge/rebase after resolving
es: Continuar merge/rebase después de resolver
pt_br: Continue merge/rebase após resolver

# Resolver com IA
source: Resolve with AI
es: Resolver con IA
pt_br: Resolver com IA

# Resolver conflito com IA
source: Resolve conflict with AI
es: Resolver conflicto con IA
pt_br: Resolver conflito com IA

# Revisar codigo com IA
source: Review code with AI
es: Revisar código con IA
pt_br: Revisar código com IA

# Sugerir divisao de commits com IA
source: Suggest commit split with AI
es: Sugerir división de commits con IA
pt_br: Sugerir divisão de commits com IA

# Sugestao de Split
source: Split Suggestion
es: Sugerencia de Split
pt_br: Sugestão de Split

# Gerar notas de release com IA
source: Generate release notes with AI
es: Generar notas de release con IA
pt_br: Gerar notas de release com IA

# De (tag/hash)
source: From (tag/hash)
es: Desde (tag/hash)
pt_br: De (tag/hash)

# Ate (tag/hash)
source: To (tag/hash)
es: Hasta (tag/hash)
pt_br: Até (tag/hash)

# Gerar
source: Generate
es: Generar
pt_br: Gerar

# Copiar
source: Copy
es: Copiar
pt_br: Copiar

# Nenhum commit encontrado no intervalo.
source: No commits found in range.
es: No se encontraron commits en el rango.
pt_br: Nenhum commit encontrado no intervalo.

# Busca semantica com IA...
source: Semantic search with AI...
es: Búsqueda semántica con IA...
pt_br: Busca semântica com IA...

# Busca semantica com IA
source: Semantic search with AI
es: Búsqueda semántica con IA
pt_br: Busca semântica com IA

# resultados
source: results
es: resultados
pt_br: resultados

# Resumir com IA
source: Summarize with AI
es: Resumir con IA
pt_br: Resumir com IA

# Resumindo...
source: Summarizing...
es: Resumiendo...
pt_br: Resumindo...

# Explicar com IA
source: Explain with AI
es: Explicar con IA
pt_br: Explicar com IA

# Nenhuma alteracao staged para revisar.
source: No staged changes to review.
es: No hay cambios staged para revisar.
pt_br: Nenhuma alteração staged para revisar.

# Critico
source: Critical
es: Crítico
pt_br: Crítico

# Aviso
source: Warning
es: Aviso
pt_br: Aviso

# Sugestao
source: Suggestion
es: Sugerencia
pt_br: Sugestão

# help.ai.conflict
source: AI-powered merge conflict resolution
es: Resolución inteligente de conflictos de merge con IA
pt_br: Resolução inteligente de conflitos de merge com IA

# help.ai.review
source: Pre-commit code review catching bugs and security issues
es: Code review pre-commit detectando bugs y problemas de seguridad
pt_br: Code review pré-commit detectando bugs e problemas de segurança

# help.ai.changelog
source: Changelog generation from commit ranges
es: Generación de changelog a partir de rangos de commits
pt_br: Geração de changelog a partir de ranges de commits

# help.ai.search
source: Natural language semantic search over git history
es: Búsqueda semántica en lenguaje natural en el historial Git
pt_br: Busca semântica em linguagem natural no histórico Git

# help.ai.branch
source: One-sentence branch summaries in context menu
es: Resumen de branches en una frase en el menú contextual
pt_br: Resumo de branches em uma frase no menu de contexto

# help.ai.blame
source: Blame explainer: understand WHY code was changed
es: Explicador de blame: entiende POR QUÉ se cambió el código
pt_br: Explicador de blame: entenda POR QUE o código foi alterado

# help.ai.split
source: Commit split advisor for atomic commits
es: Consejero de split de commits para commits atómicos
pt_br: Conselheiro de split de commits para commits atômicos

# help.ai.style
source: Toggle between compact or detailed commit messages with bullet points
es: Alterne entre mensajes compactos o detallados con bullet points
pt_br: Alterne entre mensagens compactas ou detalhadas com bullet points

# Compacto
source: Compact
es: Compacto
pt_br: Compacto

# Detalhado
source: Detailed
es: Detallado
pt_br: Detalhado

# Commit com IA
source: AI Commit
es: Commit con IA
pt_br: Commit com IA

# commit.style.compact.hint
source: Single line in Conventional Commits format
es: Una línea en formato Conventional Commits
pt_br: Uma linha no formato Conventional Commits

# commit.style.detailed.hint
source: Summary line + bullet points detailing the changes
es: Línea de resumen + bullet points detallando los cambios
pt_br: Linha de resumo + bullet points detalhando as alterações

# Aparencia
source: Appearance
es: Apariencia
pt_br: Aparência

# Claro
source: Light
es: Claro
pt_br: Claro

# Escuro
source: Dark
es: Oscuro
pt_br: Escuro

# help.customization.appearance
source: Light, dark, or automatic system appearance
es: Modo claro, oscuro o apariencia automática del sistema
pt_br: Modo claro, escuro ou automático do sistema

# Centro de Operacoes
source: Operations Center
es: Centro de Operaciones
pt_br: Centro de Operações

# Configuracoes
source: Settings
es: Configuración
pt_br: Configurações

# Editor de Codigo
source: Code Editor
es: Editor de Código
pt_br: Editor de Código

# Conflitos
source: Conflicts
es: Conflictos
pt_br: Conflitos

# Navegue e salte entre as pontas das branches.
source: Navigate and jump between branch tips.
es: Navega y salta entre las puntas de las ramas.

# Busca (Cmd+F)
source: Search (Cmd+F)
es: Búsqueda (Cmd+F)

# Carregar mais
source: Load more
es: Cargar más

# Gerencie branches, tags, stashes e alteracoes de historico.
source: Manage branches, tags, stashes, and history changes.
es: Gestiona branches, tags, stashes y cambios de historial.

# Checkout e integracao
source: Checkout and integration
es: Checkout e integración

# Selecionar branch ou hash...
source: Select branch or hash...
es: Seleccionar branch o hash...

# Fazer checkout da referencia informada?
source: Checkout the entered reference?
es: ¿Hacer checkout de la referencia ingresada?

# Fazer checkout da branch %@?
source: Checkout branch %@?
es: ¿Hacer checkout a la rama %@?

# Deseja fazer checkout para %@
source: Do you want to checkout to %@?
es: ¿Desea hacer checkout a %@?
pt_br: Deseja fazer checkout para %@?

# Executar comando
source: Execute command
es: Ejecutar comando

# Executar comando git custom informado?
source: Execute entered custom git command?
es: ¿Ejecutar el comando git personalizado ingresado?

# Salvar alteracoes locais no stash?
source: Save local changes to stash?
es: ¿Guardar cambios locales en stash?

# Aplicar o stash selecionado?
source: Apply selected stash?
es: ¿Aplicar el stash seleccionado?

# Aplicar e remover o stash selecionado?
source: Apply and remove selected stash?
es: ¿Aplicar y eliminar el stash seleccionado?

# Criar tag no commit atual?
source: Create tag at current commit?
es: ¿Crear tag en el commit actual?
