Repository: nicolaregattieri/zion-code
Catalog: Sources/Zion/Resources/*.lproj/Localizable.strings
Languages: es, pt_br

# Deseja remover a tag informada?
source: Remove the entered tag?
es: ¿Eliminar la tag ingresada?

# CUIDADO: Operacoes de reset descartam alteracoes.
source: WARNING: Reset operations discard changes.
es: ADVERTENCIA: Las operaciones de reset descartan cambios.

# Esta acao e IRREVERSIVEL. Deseja continuar?
source: This action is IRREVERSIBLE. Do you want to continue?
es: Esta acción es IRREVERSIBLE. ¿Desea continuar?

# Gerencie contextos paralelos sem trocar branch no diretorio principal.
source: Manage parallel contexts without switching branches in the main directory.
es: Gestiona contextos paralelos sin cambiar de rama en el directorio principal.

# Criar o novo worktree com os parametros informados?
source: Create the new worktree with the entered parameters?
es: ¿Crear el nuevo worktree con los parámetros ingresados?

# Remover metadados de worktrees obsoletos?
source: Remove obsolete worktree metadata?
es: ¿Eliminar metadatos de worktrees obsoletos?

# Deseja remover o worktree %@?
source: Remove worktree %@?
es: ¿Eliminar worktree %@?

# Selecione um repositorio
source: Select a repository
es: Selecciona un repositorio

# Abrir repositorio...
source: Open repository...
es: Abrir repositorio...

# Inferir origem da arvore
source: Infer tree origin
es: Inferir origen del árbol

# Salvar e restaurar alteracoes temporarias
source: Save and restore temporary changes
es: Guardar y restaurar cambios temporales
pt_br: Salvar e restaurar alterações temporárias

# Marcar pontos importantes no historico
source: Mark important points in history
es: Marcar puntos importantes en el historial
pt_br: Marcar pontos importantes no histórico

# Repositorios remotos conectados
source: Connected remote repositories
es: Repositorios remotos conectados
pt_br: Repositórios remotos conectados

# Selecione um commit para ver detalhes
source: Select a commit to view details
es: Selecciona un commit para ver detalles
pt_br: Selecione um commit para ver detalhes

# Notificacoes Push
source: Push Notifications
es: Notificaciones Push
pt_br: Notificações Push

# Terminal Externo
source: External Terminal
es: Terminal Externo
pt_br: Terminal Externo

# ntfy.onboarding.hint
source: Get push notifications on your phone and macOS via ntfy.sh
es: Recibe notificaciones en tu celular y macOS via ntfy.sh
pt_br: Receba notificações no celular e macOS via ntfy.sh

# ntfy.topic.configured
source: Topic configured
es: Tópico configurado
pt_br: Tópico configurado

# ntfy.topic.placeholder
source: Your ntfy topic (e.g. zion-my-mac)
es: Tu tópico ntfy (ej: zion-mi-mac)
pt_br: Seu tópico ntfy (ex: zion-meu-mac)

# ntfy.topic.privacy
source: Use a unique, hard-to-guess name. Anyone with the topic name can send/receive notifications.
es: Usa un nombre único y difícil de adivinar. Cualquiera con el nombre del tópico puede enviar/recibir notificaciones.
pt_br: Use um nome único e difícil de adivinhar. Qualquer pessoa com o nome do tópico pode enviar/receber notificações.

# ntfy.server.hint
source: Leave blank to use the default server (ntfy.sh)
es: Deja en blanco para usar el servidor predeterminado (ntfy.sh)
pt_br: Deixe em branco para usar o servidor padrão (ntfy.sh)

# ntfy.advanced
source: Advanced
es: Avanzado
pt_br: Avançado

# ntfy.local.toggle
source: macOS local notifications
es: Notificaciones locales de macOS
pt_br: Notificações locais do macOS

# ntfy.events.title
source: Notified Events
es: Eventos Notificados
pt_br: Eventos Notificados

# ntfy.test.button
source: Send Test Notification
es: Enviar Notificación de Prueba
pt_br: Enviar Notificação de Teste

# ntfy.test.failed
source: Failed to send test notification. Check your topic and connection.
es: Error al enviar notificación de prueba. Verifica el tópico y la conexión.
pt_br: Falha ao enviar notificação de teste. Verifique o tópico e a conexão.

# ntfy.agents.title
source: External Agents
es: Agentes Externos
pt_br: Agentes Externos

# ntfy.agents.description
source: Allow external agents (CI, scripts) to send notifications via ntfy using your configured topic.
es: Permite que agentes externos (CI, scripts) envíen notificaciones via ntfy usando tu tópico configurado.
pt_br: Permite que agentes externos (CI, scripts) enviem notificações via ntfy usando seu tópico configurado.

# ntfy.agents.enable
source: Enable external agents
es: Habilitar agentes externos
pt_br: Habilitar agentes externos

# ntfy.group.gitOps
source: Git Operations
es: Operaciones Git
pt_br: Operações Git

# ntfy.group.ai
source: AI
es: IA
pt_br: IA

# ntfy.event.cloneComplete
source: Clone complete
es: Clone completado
pt_br: Clone concluído

# ntfy.event.pushComplete
source: Push complete
es: Push completado
pt_br: Push concluído

# ntfy.event.pullComplete
source: Pull complete
es: Pull completado
pt_br: Pull concluído

# ntfy.event.newRemoteCommits
source: New remote commits
es: Nuevos commits remotos
pt_br: Novos commits remotos

# ntfy.event.codeReviewComplete
source: Code review complete
es: Code review completado
pt_br: Code review concluído

# ntfy.event.conflictResolutionReady
source: Conflict resolution ready
es: Resolución de conflicto lista
pt_br: Resolução de conflito pronta

# ntfy.event.commitMessageReady
source: Commit message ready
es: Mensaje de commit listo
pt_br: Mensagem de commit pronta

# ntfy.event.changelogReady
source: Changelog ready
es: Changelog listo
pt_br: Changelog pronto

# ntfy.event.blameExplanationReady
source: Blame explanation ready
es: Explicación de blame lista
pt_br: Explicação de blame pronta

# ntfy.event.diffExplanationReady
source: Diff explanation ready
es: Explicación de diff lista
pt_br: Explicação de diff pronta

# ntfy.event.commitSplitReady
source: Split suggestion ready
es: Sugerencia de split lista
pt_br: Sugestão de split pronta

# ntfy.event.prCreated
source: PR created
es: PR creado
pt_br: PR criado

# ntfy.event.prReviewRequested
source: PR review requested
es: Review de PR solicitado
pt_br: Review de PR solicitado

# ntfy.event.branchReviewComplete
source: Branch review complete
es: Review de branch completado
pt_br: Review de branch concluído

# map.tree.subtitle
source: Visualize Git history with color-coded lanes, search, and commit navigation.
es: Visualiza el historial de Git con lanes coloreados, búsqueda y navegación de commits.
pt_br: Visualize o histórico do Git com lanes coloridas, busca e navegação por commits.

# map.code.subtitle
source: Code editor with syntax highlighting, Quick Open, blame, and multiple tabs.
es: Editor de código con syntax highlighting, Quick Open, blame y múltiples pestañas.
pt_br: Editor de código com syntax highlighting, Quick Open, blame e múltiplas abas.

# map.terminal.subtitle
source: Real terminal with native PTY, splits, tabs, and independent zoom.
es: Terminal real con PTY nativo, splits, pestañas y zoom independiente.
pt_br: Terminal real com PTY nativo, splits, abas e zoom independente.

# map.clipboard.subtitle
source: Clipboard that auto-captures and pastes directly into the terminal.
es: Portapapeles que captura automáticamente y pega directo en el terminal.
pt_br: Clipboard que captura automaticamente e cola direto no terminal.

# map.operations.subtitle
source: Commit, staging, branches, tags, stash, interactive rebase, and more.
es: Commit, staging, branches, tags, stash, rebase interactivo y más.
pt_br: Commit, staging, branches, tags, stash, rebase interativo e mais.

# map.worktrees.subtitle
source: Work on multiple branches simultaneously with dedicated terminals.
es: Trabaja en múltiples branches simultáneamente con terminales dedicados.
pt_br: Trabalhe em múltiplas branches simultaneamente com terminais dedicados.

# map.ai.subtitle
source: AI assistant for commits, diffs, code review, conflicts, and more.
es: Asistente de IA para commits, diffs, code review, conflictos y más.
pt_br: Assistente de IA para commits, diffs, code review, conflitos e mais.

# map.customization.subtitle
source: Language, appearance, external editor, confirmations, and reflog.
es: Idioma, apariencia, editor externo, confirmaciones y reflog.
pt_br: Idioma, aparência, editor externo, confirmações e reflog.

# map.diagnostics.subtitle
source: Diagnostic log with export and automatic sanitization.
es: Log de diagnóstico con exportación y sanitización automática.
pt_br: Log de diagnóstico com exportação e sanitização automática.

# map.conflicts.subtitle
source: Resolve merge conflicts directly in Zion.
es: Resuelve conflictos de merge directamente en Zion.
pt_br: Resolva conflitos de merge diretamente no Zion.

# map.tree.lanes.title
source: Lane Graph
es: Grafo con Lanes
pt_br: Grafo com Lanes

# map.tree.lanes.description
source: Visualize branch and merge topology with color-coded lanes. Each branch gets a unique color that persists throughout navigation.
es: Visualiza la topología de branches y merges con lanes coloreados. Cada branch recibe un color único que persiste durante la navegación.
pt_br: Visualize a topologia de branches e merges com lanes coloridas. Cada branch recebe uma cor única que persiste durante toda a navegação.

# map.tree.lanes.tip1
source: Double-click a branch to filter the graph and see only its commits.
es: Doble clic en una branch para filtrar el grafo y ver solo sus commits.
pt_br: Double-click em uma branch para filtrar o grafo e ver apenas seus commits.

# map.tree.search.title
source: Graph Search
es: Búsqueda en el Grafo
pt_br: Busca no Grafo

# map.tree.search.description
source: Search by hash, author, or commit message. Navigate between results with previous/next buttons.
es: Busca por hash, autor o mensaje de commit. Navega entre resultados con botones anterior/siguiente.
pt_br: Busque por hash, autor ou mensagem de commit. Navegue entre resultados com os botões anterior/próximo.

# map.tree.search.tip1
source: Use partial terms — search matches across hash, author, and message.
es: Usa términos parciales — la búsqueda encuentra coincidencias en hash, autor y mensaje.
pt_br: Use termos parciais — a busca encontra correspondências em hash, autor e mensagem.

# map.tree.jumpbar.description
source: Instantly jump to main, develop, or the repository's default branch. Great for large repositories.
es: Salta instantáneamente a main, develop o la branch por defecto del repositorio. Ideal para repositorios grandes.
pt_br: Salte instantaneamente para main, develop ou a branch padrão do repositório. Ideal para repositórios grandes.

# map.tree.jumpbar.tip1
source: The Jump Bar automatically detects the repository's default branch.
es: El Jump Bar detecta automáticamente la branch por defecto del repositorio.
pt_br: O Jump Bar detecta automaticamente a branch padrão do repositório.

# map.tree.pending.title
source: Pending Changes
es: Cambios Pendientes
pt_br: Alterações Pendentes

# map.tree.pending.description
source: Uncommitted changes appear at the top of the graph with quick commit and stash options.
es: Los cambios sin commit aparecen al tope del grafo con opciones de commit rápido y stash.
pt_br: Mudanças não commitadas aparecem no topo do grafo com opções de commit rápido e stash.

# map.tree.pending.tip1
source: Use quick commit to git add -A and commit in one click.
es: Usa el commit rápido para hacer git add -A y commit en un clic.
pt_br: Use o commit rápido para fazer git add -A e commitar em um clique.

# map.tree.signature.title
source: Signature Verification
es: Verificación de Firma
pt_br: Verificação de Assinatura

# map.tree.signature.description
source: See if commits have a valid GPG or SSH signature directly in the graph.
es: Mira si los commits tienen firma GPG o SSH válida directamente en el grafo.
pt_br: Veja se commits possuem assinatura GPG ou SSH válida direto no grafo.

# map.tree.navigation.title
source: Keyboard Navigation
es: Navegación por Teclado
pt_br: Navegação por Teclado

# map.tree.navigation.description
source: Use arrow keys to navigate between commits. Escape to clear selection.
es: Usa las flechas para navegar entre commits. Escape para limpiar la selección.
pt_br: Use as setas para navegar entre commits. Escape para limpar a seleção.

# map.tree.navigation.tip1
source: Combine with search to jump to a commit and then navigate around it.
es: Combina con la búsqueda para saltar a un commit y luego navegar a su alrededor.
pt_br: Combine com a busca para pular para um commit e depois navegar ao redor.

# map.tree.focus.title
source: Branch Focus
es: Foco en Branch
pt_br: Foco em Branch

# map.tree.focus.description
source: Double-click a branch to filter the graph and display only that branch's commits.
es: Doble clic en una branch para filtrar el grafo y mostrar solo los commits de esa branch.
pt_br: Double-click em uma branch para filtrar o grafo e exibir apenas os commits daquela branch.

# map.tree.focus.tip1
source: Click 'Clear' to return to viewing all branches.
es: Haz clic en 'Limpiar' para volver a ver todas las branches.
pt_br: Clique em 'Limpar' para voltar a ver todas as branches.

# map.code.editor.title
source: Editor with Syntax Highlighting
es: Editor con Syntax Highlighting
pt_br: Editor com Syntax Highlighting

# map.code.editor.description
source: NSTextView-based editor with regex caching for performant highlighting. Supports multiple files in tabs.
es: Editor basado en NSTextView con caché de regex para highlighting performante. Soporta múltiples archivos en pestañas.
pt_br: Editor baseado em NSTextView com cache de regex para highlighting performático. Suporta múltiplos arquivos em abas.

# map.code.editor.tip1
source: Open files by clicking the tree or use Quick Open for fast search.
es: Abre archivos haciendo clic en el árbol o usa Quick Open para búsqueda rápida.
pt_br: Abra arquivos clicando na árvore ou use Quick Open para busca rápida.

# map.code.quickopen.description
source: Fuzzy search to open any repository file instantly. Filters as you type.
es: Búsqueda fuzzy para abrir cualquier archivo del repositorio al instante. Filtra mientras escribes.
pt_br: Busca fuzzy para abrir qualquer arquivo do repositório instantaneamente. Filtra enquanto você digita.

# map.code.quickopen.tip1
source: Type just part of the name — fuzzy search finds partial matches.
es: Escribe solo parte del nombre — la búsqueda fuzzy encuentra coincidencias parciales.
pt_br: Digite apenas parte do nome — a busca fuzzy encontra correspondências parciais.

# map.code.filebrowser.title
source: File Browser
es: Navegador de Archivos
pt_br: Navegador de Arquivos

# map.code.filebrowser.description
source: Repository file tree respecting .gitignore. Toggle visibility with u{2318}B.
es: Árbol de archivos del repositorio respetando .gitignore. Alterna visibilidad con u{2318}B.
pt_br: Árvore de arquivos do repositório com respeito ao .gitignore. Alterne visibilidade com ⌘B.

# map.code.blame.title
source: Inline Git Blame
es: Git Blame Inline
pt_br: Git Blame Inline

# map.code.blame.description
source: See author, hash, and date for each line directly in the editor. Click to view the full commit.
es: Ve autor, hash y fecha de cada línea directamente en el editor. Haz clic para ver el commit completo.
pt_br: Veja autor, hash e data de cada linha diretamente no editor. Clique para ver o commit completo.

# map.code.blame.tip1
source: With AI configured, click blame to understand WHY the code was changed.
es: Con IA configurada, haz clic en el blame para entender POR QUÉ se cambió el código.
pt_br: Com IA configurada, clique no blame para entender POR QUE o código foi alterado.

# map.code.tabs.title
source: Multiple Tabs
es: Múltiples Pestañas
pt_br: Múltiplas Abas

# map.code.tabs.description
source: Open multiple files simultaneously. Tabs with unsaved changes show a visual indicator.
es: Abre varios archivos simultáneamente. Las pestañas con cambios no guardados muestran un indicador visual.
pt_br: Abra vários arquivos simultaneamente. Abas com mudanças não salvas exibem um indicador visual.

# map.code.themes.title
source: Themes and Fonts
es: Temas y Fuentes
pt_br: Temas e Fontes

# map.code.themes.description
source: Choose from Dracula, GitHub Light, Catppuccin, One Dark Pro, Tokyo Night, and City Lights. Configurable font and size.
es: Elige entre Dracula, GitHub Light, Catppuccin, One Dark Pro, Tokyo Night y City Lights. Fuente y tamaño configurables.
pt_br: Escolha entre Dracula, GitHub Light, Catppuccin, One Dark Pro, Tokyo Night e City Lights. Fonte e tamanho configuráveis.

# map.code.themes.tip1
source: The theme also applies to the integrated terminal.
es: El tema también se aplica al terminal integrado.
pt_br: O tema também se aplica ao terminal integrado.

# map.code.watcher.title
source: External Change Detection
es: Detección de Cambios Externos
pt_br: Detecção de Mudanças Externas

# map.code.watcher.description
source: The editor automatically detects when a file is changed by another program and offers to reload.
es: El editor detecta automáticamente cuando un archivo es modificado por otro programa y ofrece recargarlo.
pt_br: O editor detecta automaticamente quando um arquivo é alterado por outro programa e oferece recarregar.

# map.terminal.pty.title
source: Real PTY Terminal
es: Terminal Real con PTY
pt_br: Terminal Real com PTY

# map.terminal.pty.description
source: Full terminal with native PTY, login shell (-l), and xterm-256color support. Runs any command.
es: Terminal completo con PTY nativo, login shell (-l) y soporte xterm-256color. Ejecuta cualquier comando.
pt_br: Terminal completo com PTY nativo, login shell (-l) e suporte a xterm-256color. Roda qualquer comando.

# map.terminal.pty.tip1
source: The terminal uses your default shell configuration (zsh, bash, fish).
es: El terminal usa tu configuración de shell predeterminada (zsh, bash, fish).
pt_br: O terminal usa sua configuração de shell padrão (zsh, bash, fish).

# map.terminal.splits.title
source: Vertical and Horizontal Splits
es: Splits Vertical y Horizontal
pt_br: Splits Vertical e Horizontal

# map.terminal.splits.description
source: Split the terminal into vertical or horizontal panes to work with multiple commands side by side.
es: Divide el terminal en paneles verticales u horizontales para trabajar con múltiples comandos lado a lado.
pt_br: Divida o terminal em painéis verticais ou horizontais para trabalhar com múltiplos comandos lado a lado.

# map.terminal.splits.tip1
source: Close a split pane with u{21E7}u{2318}W without affecting the others.
es: Cierra un panel split con u{21E7}u{2318}W sin afectar los demás.
pt_br: Feche um painel split com ⇧⌘W sem afetar os outros.

# map.terminal.tabs.title
source: Terminal Tabs
es: Pestañas de Terminal
pt_br: Abas de Terminal

# map.terminal.tabs.description
source: Create multiple terminal tabs, each with its own independent process and status indicator.
es: Crea múltiples pestañas de terminal, cada una con su proceso independiente e indicador de estado.
pt_br: Crie múltiplas abas de terminal, cada uma com seu processo independente e indicador de status.

# map.terminal.zoom.title
source: Independent Zoom
es: Zoom Independiente
pt_br: Zoom Independente

# map.terminal.zoom.description
source: Adjust terminal font size independently from the editor with Ctrl+ and Ctrl-.
es: Ajusta el tamaño de fuente del terminal independientemente del editor con Ctrl+ y Ctrl-.
pt_br: Ajuste o tamanho da fonte do terminal independentemente do editor com Ctrl+ e Ctrl-.

# map.terminal.persistence.title
source: Session Persistence
es: Persistencia de Sesiones
pt_br: Persistência de Sessões

# map.terminal.persistence.description
source: Terminal sessions persist across repository switches. Orange badges show changed file counts.
es: Las sesiones de terminal persisten al cambiar de repositorio. Badges naranjas muestran la cantidad de archivos modificados.
pt_br: Sessões de terminal persistem ao trocar de repositório. Badges laranja mostram contagem de arquivos alterados.

# map.terminal.persistence.tip1
source: Your processes keep running even when navigating to another repository.
es: Tus procesos siguen ejecutándose incluso al navegar a otro repositorio.
pt_br: Seus processos continuam rodando mesmo ao navegar para outro repositório.

# map.clipboard.capture.title
source: Auto-Capture
es: Captura Automática
pt_br: Captura Automática

# map.clipboard.capture.description
source: Monitors the system clipboard and automatically captures text, commands, hashes, URLs, and images.
es: Monitorea el portapapeles del sistema y captura automáticamente texto, comandos, hashes, URLs e imágenes.
pt_br: Monitora o clipboard do sistema e captura automaticamente texto, comandos, hashes, URLs e imagens.

# map.clipboard.capture.tip1
source: The clipboard keeps up to 20 items, automatically removing the oldest.
es: El portapapeles mantiene hasta 20 elementos, eliminando los más antiguos automáticamente.
pt_br: O clipboard mantém até 20 itens, removendo os mais antigos automaticamente.

# map.clipboard.paste.title
source: Paste and Execute
es: Pegar y Ejecutar
pt_br: Colar e Executar

# map.clipboard.paste.description
source: Click an item to paste in terminal. Double-click to execute immediately (sends with Enter).
es: Haz clic en un elemento para pegar en el terminal. Doble clic para ejecutar inmediatamente (envía con Enter).
pt_br: Clique em um item para colar no terminal. Duplo clique para executar imediatamente (envia com Enter).

# map.clipboard.drag.title
source: Drag to Terminal
es: Arrastrar al Terminal
pt_br: Arrastar para o Terminal

# map.clipboard.drag.description
source: Drag clipboard items directly into any terminal pane.
es: Arrastra elementos del portapapeles directamente a cualquier panel del terminal.
pt_br: Arraste itens do clipboard diretamente para qualquer painel do terminal.

# map.clipboard.images.title
source: Image Capture
es: Captura de Imágenes
pt_br: Captura de Imagens

# map.clipboard.images.description
source: Copied images are saved as temporary JPEGs. Automatic cleanup after 1 hour and on app exit.
es: Las imágenes copiadas se guardan como JPEG temporal. Limpieza automática después de 1 hora y al salir del app.
pt_br: Imagens copiadas são salvas como JPEG temporário. Limpeza automática após 1 hora e na saída do app.

# map.clipboard.images.tip1
source: Useful for capturing screenshots to paste in issues or documentation.
es: Útil para capturar screenshots y pegar en issues o documentación.
pt_br: Útil para capturar screenshots e colar em issues ou documentação.

# map.ops.commit.title
source: Commit with Staging
es: Commit con Staging
pt_br: Commit com Staging

# map.ops.commit.description
source: Create commits with per-file staging, amend option, and AI-generated messages.
es: Crea commits con staging individual por archivo, opción de amend y mensajes generados por IA.
pt_br: Faça commits com staging individual por arquivo, opção de amend e mensagens geradas por IA.

# map.ops.commit.tip1
source: Use the AI button to generate messages in Conventional Commits format.
es: Usa el botón de IA para generar mensajes en formato Conventional Commits.
pt_br: Use o botão de IA para gerar mensagens no formato Conventional Commits.

# map.ops.hunk.title
source: Hunk and Line Staging
es: Staging por Hunk y Línea
pt_br: Staging por Hunk e Linha

# map.ops.hunk.description
source: Add or remove individual hunks and lines from staging for granular control over what goes into the commit.
es: Agrega o quita hunks y líneas individuales del staging para control granular de lo que entra en el commit.
pt_br: Adicione ou remova hunks e linhas individuais do stage para controle granular do que entra no commit.

# map.ops.hunk.tip1
source: Perfect for separating logical changes into atomic commits.
es: Perfecto para separar cambios lógicos en commits atómicos.
pt_br: Perfeito para separar mudanças lógicas em commits atômicos.
