Repository: nicolaregattieri/zion-code
Catalog: Sources/Zion/Resources/*.lproj/Localizable.strings
Languages: es, pt_br

source: Workspace
es: Espacio de trabajo

# Seu cliente Git nativo para macOS.
source: Your native Git client for macOS.
es: Tu cliente Git nativo para macOS.
pt_br: Seu cliente Git nativo para macOS.

source: The view from the top.
es: La vista desde la cima.
pt_br: A vista do topo.

# Operacoes
source: Operations
es: Operaciones
pt_br: Operações

# Historico visual, navega em commits e merges
source: Visual history, navigate commits and merges
es: Historial visual, navega commits y merges

# Fluxos de branch/tag/stash e comandos Git
source: Branch/tag/stash flows and Git commands
es: Flujos de branch/tag/stash y comandos Git

# Gerencia worktrees paralelos
source: Manage parallel worktrees
es: Gestiona worktrees paralelos

# Seleciona um repositorio Git para abrir no Zion.
source: Select a Git repository to open in Zion.
es: Selecciona un repositorio Git para abrir en Zion.

# Recarrega branches, commits, tags, stashes e worktrees do repositorio atual.
source: Reloads branches, commits, tags, stashes, and worktrees of the current repository.
es: Recarga branches, commits, tags, stashes y worktrees del repositorio actual.

# Baixa atualizacoes dos remotos sem alterar sua branch local.
source: Downloads updates from remotes without changing your local branch.
es: Descarga actualizaciones de remotos sin cambiar tu branch local.

# Atualiza a branch atual com commits do remoto via fast-forward.
source: Updates the current branch with remote commits via fast-forward.
es: Actualiza la branch actual con commits remotos via fast-forward.

# Envia commits locais da branch atual para o remoto.
source: Sends local commits from the current branch to the remote.
es: Envia commits locales de la branch actual al remoto.

# Seguranca
source: Security
es: Seguridad
pt_br: Segurança

# Confirmacao
source: Confirmation
es: Confirmación
pt_br: Confirmação

# Nunca confirmar
source: Never confirm
es: Nunca confirmar
pt_br: Nunca confirmar

# Confirmar acoes criticas
source: Confirm critical actions
es: Confirmar acciones criticas

# Confirmar todas as acoes
source: Confirm all actions
es: Confirmar todas las acciones

# Controla quando mostrar dialogo de confirmacao antes de executar comandos Git.
source: Controls when to show confirmation dialogs before executing Git commands.
es: Controla cuando mostrar dialogos de confirmacion antes de ejecutar comandos Git.

# Inferir origem da arvore (best practice)
source: Infer tree origin (best practice)
es: Inferir origen del arbol (best practice)

source: When active, attempts to infer origin branch and fork point in the branch tree.
es: Cuando esta activo, intenta inferir branch de origen y punto de fork en el arbol de branches.

# Idioma
source: Language
es: Idioma
pt_br: Idioma

# Define o idioma da interface (pt-BR, English ou Espanol).
source: Sets the interface language (pt-BR, English, or Spanish).
es: Define el idioma de la interfaz (pt-BR, English o Espanol).

# Nenhum repositorio
source: No repository
es: Ningun repositorio

# Clique em Abrir para selecionar um repositorio Git
source: Click Open to select a Git repository
es: Haz clic en Abrir para seleccionar un repositorio Git

# Abrir
source: Open
es: Abrir
pt_br: Abrir

# Atualizar
source: Refresh
es: Actualizar
pt_br: Atualizar

source: Push to Remote
es: Enviar a Remoto
pt_br: Enviar para Remoto

source: New Branch
es: Nueva Rama
pt_br: Nova Branch

# Navegue no historico, inspecione commits e veja origem das branches.
source: Navigate history, inspect commits, and view branch origins.
es: Navega el historial, inspecciona commits y ve origenes de branches.

# Buscar por hash, autor ou mensagem
source: Search by hash, author, or message
es: Buscar por hash, autor o mensaje

# itens
source: items
es: elementos

# Nenhum commit encontrado
source: No commits found
es: No se encontraron commits

# Ajuste a busca para visualizar commits.
source: Adjust search to view commits.
es: Ajusta la buqueda para ver commits.

# Carregar mais commits (+300)
source: Load more commits (+300)
es: Cargar mas commits (+300)

# Detalhes do commit
source: Commit details
es: Detalles del commit

# Filtro:
source: Filter:
es: Filtro:

# Limpar
source: Clear
es: Limpiar

# Sem branches detectadas
source: No branches detected
es: No se detectaron branches
pt_br: Sem branches detectadas

# Abra um repositorio com refs para visualizar a arvore.
source: Open a repository with refs to view the tree.
es: Abre un repositorio con refs para ver el arbol.

# Operacoes Git
source: Git Operations
es: Operaciones Git

# Checkout, criacao e merge
source: Checkout, creation, and merge
es: Checkout, creacion y merge

source: Type a branch/ref manually or click one from the list to fill the field.
es: Escribe una branch/ref manualmente o haz clic en una de la lista para completar el campo.

# Nova
source: New
es: Nueva

# Branches locais/remotas
source: Local/remote branches
es: Branches locales/remotas

# Cria e remove tags rapidamente
source: Create and remove tags quickly
es: Crea y elimina tags rapidamente

# A lista abaixo mostra tags existentes. Clique em uma tag para preencher o campo.
source: The list below shows existing tags. Click a tag to fill the field.
es: The list de abajo muestra tags existentes. Haz clic en una tag para completar el campo.

# Criar
source: Create
es: Crear
pt_br: Criar

# Remover
source: Remove
es: Eliminar

# Salva e reaplica alteracoes locais
source: Save and reapply local changes
es: Guarda y reaplica cambios locales

# mensagem do stash
source: stash message
es: mensaje del stash

# Criar stash
source: Create stash
es: Crear stash

# Historico
source: History
es: Historial
pt_br: Histórico

# Rebase e cherry-pick
source: Rebase and cherry-pick
es: Rebase y cherry-pick

source: rebase target
es: objetivo de rebase

source: cherry-pick hash
es: hash de cherry-pick

# Zona sensivel: altera historico local
source: Sensitive zone: alters local history
es: Zona sensible: altera historial local

# Comando custom
source: Custom Command
es: Comando personalizado
pt_br: Comando custom

# Executa qualquer comando git
source: Executes any git command
es: Ejecuta cualquier comando git

# Worktrees disponiveis
source: Available worktrees
es: Worktrees disponibles

# Adicionar worktree
source: Add worktree
es: Agregar worktree

# Defina caminho e branch opcional
source: Define path and optional branch
es: Define ruta y branch opcional

# /caminho/para/worktree
source: /path/to/worktree
es: /ruta/para/worktree

# Adicionar
source: Add
es: Agregar

# Nenhum worktree encontrado
source: No worktree found
es: No se encontro ningun worktree

# Crie un novo worktree para comecar a trabalhar em paralelo.
source: Create a new worktree to start working in parallel.
es: Crea un nuevo worktree para empezar a trabajar en paralelo.

# ATUAL
source: CURRENT
es: ACTUAL

# Abrir repositorio
source: Open repository
es: Abrir repositorio

source: Your native Git client for macOS. Open a repository to view history, execute commands, and manage worktrees.
es: Tu cliente Git nativo para macOS. Abre un repositorio para ver historial, ejecutar comandos y gestionar worktrees.

# Nova branch a partir de %@
source: New branch from %@
es: Nueva rama a partir de %@
pt_br: Nova branch a partir de %@

# Remover branch remota
source: Delete remote branch
es: Eliminar rama remota
pt_br: Remover branch remota

# Deseja remover permanentemente a branch remota %@?
source: Do you want to permanently delete the remote branch %@?
es: ¿Desea eliminar permanentemente la rama remota %@?
pt_br: Deseja remover permanentemente a branch remota %@?

# Remover branch local
source: Delete local branch
es: Eliminar rama local
pt_br: Remover branch local

# Deseja remover a branch local %@?
source: Do you want to delete the local branch %@?
es: ¿Desea eliminar la rama local %@?
pt_br: Deseja remover a branch local %@?

# Remover branch local (Force)
source: Delete local branch (Force)
es: Eliminar rama local (Forzar)
pt_br: Remover branch local (Force)

# Deseja remover FORCADO a branch local %@?
source: Do you want to FORCE delete the local branch %@?
es: ¿Desea eliminar FORZADO la rama local %@?
pt_br: Deseja remover FORÇADO a branch local %@?

# Fazer merge da branch informada na atual?
source: Merge the entered branch into the current one?
es: ¿Hacer merge de la rama informada en la actual?
pt_br: Fazer merge da branch informada na atual?

# Rebasear a branch atual no target informado?
source: Rebase current branch onto entered target?
es: ¿Rebasear la rama actual en el objetivo informado?
pt_br: Rebasear a branch atual na referência informada?

# Nova branch
source: New branch
es: Nueva rama
pt_br: Nova branch

# Cancelar
source: Cancel
es: Cancelar
pt_br: Cancelar

# Fazer checkout
source: Checkout
es: Hacer checkout
pt_br: Fazer checkout

source: Checkout & Pull
es: Checkout y Pull
pt_br: Checkout e Pull

# Deseja fazer checkout de %@ e puxar as alterações?
source: Do you want to checkout %@ and pull changes?
es: ¿Desea hacer checkout a %@ y traer los cambios?
pt_br: Deseja fazer checkout de %@ e puxar as alterações?

# Checkout e Pull concluídos para %@
source: Checkout and Pull complete for %@
es: Checkout y Pull completados para %@
pt_br: Checkout e Pull concluídos para %@

# Confirmar
source: Confirm
es: Confirmar
pt_br: Confirmar

# Continuar
source: Continue
es: Continuar
pt_br: Continuar

# Nova tag
source: New tag
es: Nueva tag
pt_br: Nova tag

# Nome:
source: Name:
es: Nombre:
pt_br: Nome:

# Adicionar Tag...
source: Add Tag...
es: Agregar Tag...
pt_br: Adicionar Tag...

# Criar Branch...
source: Create Branch...
es: Crear Rama...
pt_br: Criar Branch...

# Abrir no Editor
source: Open in Editor
es: Abrir en el Editor
pt_br: Abrir no Editor

# Copiar Hash
source: Copy Hash
es: Copiar Hash
pt_br: Copiar Hash

# Checkout & Abrir no Editor
source: Checkout & Open in Editor
es: Checkout y abrir en el editor
pt_br: Checkout & Abrir no Editor

# Filtro de branch ativo: %@ · %@ commits
source: Branch filter active: %@ · %@ commits
es: Filtro de rama activo: %@ · %@ commits
pt_br: Filtro de branch ativo: %@ · %@ commits

# Visualizando todas as branches · %@ commits
source: Viewing all branches · %@ commits
es: Viendo todas las ramas · %@ commits
pt_br: Visualizando todas as branches · %@ commits

# Repositorio carregado: %@ · %@ commits
source: Repository loaded: %@ · %@ commits
es: Repositorio cargado: %@ · %@ commits
pt_br: Repositório carregado: %@ · %@ commits

# Resolva os conflitos na sua IDE favorita.
source: Resolve conflicts in your favorite IDE.
es: Resuelve los conflictos en tu IDE favorita.
pt_br: Resolva os conflitos na sua IDE favorita.

# Limpeza
source: Clean Up
es: Limpieza
pt_br: Limpeza

# Remover branches locais que ja foram mescladas na main.
source: Remove local branches that have already been merged into main.
es: Eliminar ramas locales que ya han sido fusionadas en main.
pt_br: Remover branches locais que já foram mescladas na main.

# Deseja remover todas as branches locais ja mescladas?
source: Do you want to remove all local branches already merged?
es: ¿Desea eliminar todas las ramas locales ya fusionadas?
pt_br: Deseja remover todas as branches locais já mescladas?

source: Prune Merged
es: Limpiar Fusionadas
pt_br: Limpar Mescladas

# Limpeza concluida: %@ branches removidas.
source: Cleanup complete: %@ branches removed.
es: Limpieza completada: %@ ramas eliminadas.
pt_br: Limpeza concluída: %@ branches removidas.

# Branches removidas: %@
source: Branches removed: %@
es: Ramas eliminadas: %@
pt_br: Branches removidas: %@

# Nenhuma branch mesclada encontrada.
source: No merged branches found.
es: No se encontraron ramas fusionadas.
pt_br: Nenhuma branch mesclada encontrada.

# Nao e um repositorio Git
source: Not a Git repository
es: No es un repositorio Git
pt_br: Não é um repositório Git

# Este diretorio nao possui um repositorio Git inicializado.
source: This directory does not have an initialized Git repository.
es: Este directorio no tiene un repositorio Git inicializado.
pt_br: Este diretório não possui um repositório Git inicializado.

# Inicializar Repositorio
source: Initialize Repository
es: Inicializar Repositorio
pt_br: Inicializar Repositório

# Voltar
source: Back
es: Volver
pt_br: Voltar

# nome
source: name
es: nombre
pt_br: nome

# Nenhum remote configurado
source: No remotes configured
es: Ningún remote configurado
pt_br: Nenhum remote configurado

# Remover remote
source: Remove remote
es: Eliminar remote
pt_br: Remover remote

# Deseja remover o remote %@?
source: Do you want to remove remote %@?
es: ¿Desea eliminar el remote %@?
pt_br: Deseja remover o remote %@?

# Testar conexao
source: Test Connection
es: Probar conexión
pt_br: Testar conexão

# Novo Commit
source: New Commit
es: Nuevo Commit
pt_br: Novo Commit

# Gravar alteracoes no repositorio
source: Record changes in the repository
es: Grabar cambios en el repositorio
pt_br: Gravar alterações no repositório

# Mensagem do commit...
source: Commit message...
es: Mensaje del commit...
pt_br: Mensagem do commit...

# Fazer Commit
source: Commit
es: Hacer Commit
pt_br: Fazer Commit

# Deseja realizar o commit de todas as alterações?
source: Do you want to commit all changes?
es: ¿Desea realizar el commit de todos los cambios?
pt_br: Deseja realizar o commit de todas as alterações?

# Commit realizado com sucesso.
source: Commit successful.
es: Commit realizado con éxito.
pt_br: Commit realizado com sucesso.

# Acoes Rapidas
source: Quick Actions
es: Acciones Rápidas
pt_br: Ações Rápidas

# Arquivos alterados
source: Changed files
es: Archivos modificados
pt_br: Arquivos alterados

# Selecionar Tudo
source: Select All
es: Seleccionar Todo
pt_br: Selecionar Tudo

# Desmarcar Tudo
source: Deselect All
es: Desmarcar Todo
pt_br: Desmarcar Tudo

# Adicionar ao .gitignore
source: Add to .gitignore
es: Añadir a .gitignore
pt_br: Adicionar ao .gitignore

# Adicionado ao .gitignore: %@
source: Added to .gitignore: %@
es: Añadido a .gitignore: %@
pt_br: Adicionado ao .gitignore: %@

# Alteracoes Pendentes
source: Pending Changes
es: Cambios Pendientes
pt_br: Alterações Pendentes

# Ver Mudanças
source: View Changes
es: Ver Cambios
pt_br: Ver Mudanças

# Tudo limpo!
source: All clean!
es: ¡Todo limpio!
pt_br: Tudo limpo!

# Nenhuma alteração pendente no momento.
source: No pending changes at the moment.
es: No hay cambios pendientes en este momento.
pt_br: Nenhuma alteração pendente no momento.

# Selecione um arquivo para ver as mudanças.
source: Select a file to see changes.
es: Seleccione un archivo para ver los cambios.
pt_br: Selecione um arquivo para ver as mudanças.

# Arquivos
source: Files
es: Archivos
pt_br: Arquivos

# Salvar
source: Save
es: Guardar
pt_br: Salvar

# Arquivo salvo: %@
source: File saved: %@
es: Archivo guardado: %@
pt_br: Arquivo salvo: %@

# Selecione um arquivo para editar.
source: Select a file to edit.
es: Seleccione un archivo para editar.
pt_br: Selecione um arquivo para editar.

# Nenhuma mudanca detectada (ou arquivo novo nao rastreado).
source: No changes detected (or new untracked file).
es: No se detectaron cambios (o archivo nuevo no rastreado).
pt_br: Nenhuma mudança detectada (ou arquivo novo não rastreado).

# arquivos modificados
source: modified files
es: archivos modificados
pt_br: arquivos modificados

source: Attempts to automatically detect which branch each one was created from to organize the sidebar tree hierarchically. Recommended for repositories with many branches.
es: Intenta detectar automáticamente de qué rama se creó cada una para organizar el árbol lateral jerárquicamente. Recomendado para repositorios con muchas ramas.
pt_br: Tenta detectar automaticamente de qual branch cada uma foi criada para organizar a árvore lateral de forma hierárquica. Recomendado para repositórios com muitas branches.

source: Author
es: Autor
pt_br: Autor

source: Date
es: Fecha
pt_br: Data

source: Commit Date
es: Fecha de Commit
pt_br: Data do Commit

source: locked
es: bloqueado
pt_br: bloqueado

source: prunable
es: podable
pt_br: podável

# Ferramentas Externas
source: External Tools
es: Herramientas Externas
pt_br: Ferramentas Externas

source: current
es: actual
pt_br: atual

# Selecione seu Editor de Codigo favorito
source: Select your favorite Code Editor
es: Selecciona tu Editor de Código favorito
pt_br: Selecione seu Editor de Código favorito

# Selecione seu Terminal favorito
source: Select your favorite Terminal
es: Selecciona tu Terminal favorito
pt_br: Selecione seu Terminal favorito

source: Abort
es: Abortar
pt_br: Abortar

source: Apply Stash
es: Aplicar Stash
pt_br: Aplicar Stash

# Aplicar as mudancas deste stash na branch atual?
source: Apply this stash's changes to the current branch?
es: ¿Aplicar los cambios de este stash a la branch actual?
pt_br: Aplicar as mudanças deste stash na branch atual?

# Aplicar as mudancas deste stash e REMOVER da lista?
source: Apply this stash's changes and REMOVE from list?
es: ¿Aplicar los cambios de este stash y ELIMINAR de la lista?
pt_br: Aplicar as mudanças deste stash e REMOVER da lista?

# Remover permanentemente este stash?
source: Permanently remove this stash?
es: ¿Eliminar permanentemente este stash?
pt_br: Remover permanentemente este stash?

# Checkout Stash (Inspecionar)
source: Checkout Stash (Inspect)
es: Checkout Stash (Inspeccionar)
pt_br: Checkout Stash (Inspecionar)

source: Reset Branch to here (Soft)
es: Reset Branch aquí (Soft)
pt_br: Reset Branch aqui (Soft)

source: Reset Branch to here (Hard)
es: Reset Branch aquí (Hard)
pt_br: Reset Branch aqui (Hard)

# Resetar a branch atual para este commit mantendo as mudancas no stage?
source: Reset current branch to this commit keeping changes staged?
es: ¿Resetear la branch actual a este commit manteniendo los cambios en stage?
pt_br: Resetar a branch atual para este commit mantendo as mudanças no stage?

# AVISO: Isso apagara todas as mudancas nao salvas. Continuar?
source: WARNING: This will erase all unsaved changes. Continue?
es: AVISO: Esto borrará todos los cambios no guardados. ¿Continuar?
pt_br: AVISO: Isso apagará todas as mudanças não salvas. Continuar?

# Copiar Assunto
source: Copy Subject
es: Copiar Asunto
pt_br: Copiar Assunto

# Copiar Nome da Branch
source: Copy Branch Name
es: Copiar Nombre de Branch
pt_br: Copiar Nome da Branch

# Modo editor livre
source: Free editor mode
es: Modo editor libre
pt_br: Modo editor livre

# Abrir Pasta
source: Open Folder
es: Abrir Carpeta
pt_br: Abrir Pasta

# Abrir Externamente
source: Open Externally
es: Abrir Externamente
pt_br: Abrir Externamente

# Abrir o repositorio no seu editor ou terminal favorito.
source: Open repository in your favorite editor or terminal.
es: Abre el repositorio en tu editor o terminal favorito.
pt_br: Abrir o repositório no seu editor ou terminal favorito.

# Abrir repositório
source: Open repository
es: Abrir repositorio
pt_br: Abrir repositório

# Atualizar status do repositório
source: Refresh repository status
es: Actualizar estado del repositorio
pt_br: Atualizar status do repositório

# Fetch: Busca atualizações remotas
source: Fetch: Download remote updates
es: Fetch: Descarga actualizaciones remotas
pt_br: Fetch: Busca atualizações remotas

# Pull: Puxa alterações da branch atual
source: Pull: Pull changes from current branch
es: Pull: Trae cambios de la branch actual
pt_br: Pull: Puxa alterações da branch atual

# Push: Envia alterações locais
source: Push: Send local changes
es: Push: Envía cambios locales
pt_br: Push: Envia alterações locais

# Abrir no Editor de Código
source: Open in Code Editor
es: Abrir en Editor de Código
pt_br: Abrir no Editor de Código

# Abrir Terminal
source: Open Terminal
es: Abrir Terminal
pt_br: Abrir Terminal

# Atualizar Grafo
source: Refresh Graph
es: Actualizar Grafo
pt_br: Atualizar Grafo

# Criar Commit Rapido
source: Quick Commit
es: Commit Rápido
pt_br: Criar Commit Rápido

# Suas alteracoes serao rastreadas automaticamente (git add -A).
source: Your changes will be tracked automatically (git add -A).
es: Tus cambios serán rastreados automáticamente (git add -A).
pt_br: Suas alterações serão rastreadas automaticamente (git add -A).

# Criar Novo Stash
source: Create New Stash
es: Crear Nuevo Stash
pt_br: Criar Novo Stash

# Gerenciar Stashes...
source: Manage Stashes...
es: Gestionar Stashes...
pt_br: Gerenciar Stashes...

# Mensagem do stash (opcional)
source: Stash message (optional)
es: Mensaje del stash (opcional)
pt_br: Mensagem do stash (opcional)

# Stashes Recentes
source: Recent Stashes
es: Stashes Recientes
pt_br: Stashes Recentes

# Fechar
source: Close
es: Cerrar
pt_br: Fechar

source: Changes
es: Cambios
pt_br: Alterações

# Quebra de Linha Automática
source: Word Wrap
es: Ajuste de Línea Automático
pt_br: Quebra de Linha Automática

# Nenhum arquivo encontrado
source: No files found
es: Ningún archivo encontrado
pt_br: Nenhum arquivo encontrado

# Selecionar Pasta
source: Select Folder
es: Seleccionar Carpeta
pt_br: Selecionar Pasta

# Selecione um arquivo
source: Select a file
es: Seleccione un archivo
pt_br: Selecione um arquivo

# Nenhum terminal aberto
source: No terminal open
es: Ningún terminal abierto
pt_br: Nenhum terminal aberto

# Buscar arquivo...
source: Search file...
es: Buscar archivo...
pt_br: Buscar arquivo...

# Contextos paralelos
source: Parallel contexts
es: Contextos paralelos
pt_br: Contextos paralelos

source: Apply stash
es: Aplicar stash
pt_br: Aplicar stash

# Nenhuma branch encontrada
source: No branches found
es: No se encontraron branches
pt_br: Nenhuma branch encontrada

# Deseja fazer checkout para %@?
source: Do you want to checkout to %@?
es: ¿Desea hacer checkout a %@?
pt_br: Deseja fazer checkout para %@?

# Corrigir ultimo commit (Amend)
source: Amend last commit (Amend)
es: Corregir último commit (Amend)
pt_br: Corrigir último commit (Amend)

# Descartar alteracoes
source: Discard changes
es: Descartar cambios
pt_br: Descartar alterações

# Descartar
source: Discard
es: Descartar
pt_br: Descartar

# Deseja reverter todas as mudancas neste arquivo? Isso nao pode ser desfeito.
source: Do you want to revert all changes in this file? This cannot be undone.
es: ¿Desea revertir todos los cambios en este archivo? Esto no se puede deshacer.
pt_br: Deseja reverter todas as mudanças neste arquivo? Isso não pode ser desfeito.

# Confirmar criticas
source: Confirm destructive
es: Confirmar críticas
pt_br: Confirmar críticas

# Confirmar todas
source: Confirm all
es: Confirmar todas
pt_br: Confirmar todas

# Selecionar do Disco...
source: Select from Disk...
es: Seleccionar del disco...
pt_br: Selecionar do Disco...

# Modificado
source: Modified
es: Modificado
pt_br: Modificado

# Nao inicializado
source: Not initialized
es: No inicializado
pt_br: Não inicializado

# Sistema
source: System
es: Sistema
pt_br: Sistema

# (Atual)
source: (Current)
es: (Actual)
pt_br: (Atual)

# (Double-click para checkout)
source: (Double-click to checkout)
es: (Doble clic para checkout)
pt_br: (Double-click para checkout)

# Chave SSH
source: SSH Key
es: Clave SSH
pt_br: Chave SSH

# Configuracao SSH
source: SSH Config
es: Configuración SSH
pt_br: Configuração SSH

# Acesso ao Keychain
source: Keychain Access
es: Acceso al Keychain
pt_br: Acesso ao Keychain

# Fonte nao encontrada, usando fallback
source: Font not found, using fallback
es: Fuente no encontrada, usando fallback
pt_br: Fonte não encontrada, usando fallback

# Dividir verticalmente
source: Split vertically
es: Dividir verticalmente
pt_br: Dividir verticalmente

# Dividir horizontalmente
source: Split horizontally
es: Dividir horizontalmente
pt_br: Dividir horizontalmente

# Alternar painel de arquivos
source: Toggle file browser
es: Alternar panel de archivos
pt_br: Alternar painel de arquivos
